{
  "id": "014e98ba3ad348cf891efed2d3853687e17ae363639ab9b625e89751375662c2",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1760209417,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-2-sept-28-2025-the-nearness-of-heaven"
    ],
    [
      "title",
      "Free Article 2 (Sept. 28, 2025): The Nearness of Heaven"
    ],
    [
      "published_at",
      "1760209417"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "A closing meditation on the thinness of the veil between worlds and the quiet assurance that love is gathered, not gone."
    ],
    [
      "display_date",
      "2025-09-28"
    ],
    [
      "t",
      "heaven"
    ],
    [
      "t",
      "hope"
    ],
    [
      "t",
      "grief"
    ],
    [
      "t",
      "faith"
    ],
    [
      "t",
      "resurrection"
    ],
    [
      "t",
      "continuumessays"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "5ba259bad0ba50ddefca039acc5d753fe51c30e19180511de9a0951fefbc9ae9",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Sept. 28, 2025\n\nSometimes heaven feels closer than the air.\nIt does not appear with thunder or trumpets, but in the hush between breaths — the space where we realize this life and the next are not separated by miles but by veils.\n\nThat Sunday morning, light filled the room. My father slept. The world outside went on — traffic, dogs, laughter — but inside, time stood still. I understood then why Scripture calls death “gain.” It’s not because we leave behind what we love, but because what we love is gathered up and made whole.\n\nHeaven is not elsewhere; it is home completed. It breaks in when we learn to see beyond fear. In those hours I stopped thinking about loss and began to glimpse restoration — a universe where nothing truly good is ever lost, only transformed.\n\nGrief taught me to look through things, not at them. Every flicker of sunlight became a promise. Every breath, a rehearsal for resurrection.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net\n\n## Copyright\n\n© 2025 Continuum — All rights reserved.",
  "sig": "d1f42881bb5b8ef58c5890908c260b9cbb4b18668fea3c0486307dbf012f652f52d117632d883cc03450ce70c7ed932d39cfd73f41abf5656aed6ffb4e98e6ea",
  "_source": [
    "primal backup",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nostr.bitcoiner.social",
    "wss://relay.damus.io"
  ]
}