{
  "content": "Andrew G. Stanton - Aug. 16, 2025\n\n# From Anger to Proof: A Journey with Sovereignty, Hawai‘i, and Bitcoin\n\n## University Days in Hawai‘i\n\nIn the late 1980s and early 1990s, I was finishing my B.S. in Physics and Math and beginning graduate studies in Electrical Engineering at the University of Hawai‘i. My world was numbers, equations, and circuits — a realm where truth had to be proven, not just proclaimed.  \n\nBut outside the classroom, another kind of truth was being shouted in lecture halls and rallies: **sovereignty.**  \n\nI remember attending speeches by Haunani-Kay Trask, one of the fiercest voices in the Hawaiian sovereignty movement. She spoke with fiery anger — not an act, but a lived rage, sharpened and delivered with theatrical force. Her words were raw, uncompromising, and unforgettable. That anger carried the weight of centuries of dispossession. Even if I didn’t yet have the language, I knew it was truth.  \n\nAround the same time, I read *Sovereignty: Do the Facts Matter?* by Thurston Twigg-Smith, a descendant of the families tied to the overthrow of the Hawaiian monarchy in 1893 and longtime publisher of the *Honolulu Advertiser.* His arguments were pragmatic, cautious. He warned that “true sovereignty” was impractical, even dangerous. Hawai‘i, he argued, was modern now, economically tied to the United States and the global system. Trying to resurrect sovereignty would cause instability and chaos.  \n\nI respected his caution, just as I felt the truth in Trask’s anger. Both perspectives carried weight. But neither offered a clear path forward.  \n\nBack then, I didn’t have the words. I just knew sovereignty mattered.  \n\n---\n\n## A Mixed Legacy: Unity and Conquest\n\nPart of what made sovereignty so complex in Hawai‘i was its own history.  \n\nBefore the late 1700s, each island had its own ali‘i (chiefs), its own governance. Power was local, but wars between chiefs were frequent.  \n\nThen came **Kamehameha I.** Through conquest and diplomacy, he unified the islands into a single Hawaiian Kingdom. It was a historic achievement: unity brought stability, reduced warfare, and gave Hawai‘i stronger footing in dealing with foreign powers. For the first time, the islands could negotiate with the outside world as one.  \n\nKamehameha’s rule was also marked by one of the most remarkable laws in Hawaiian history: the *Kānāwai Māmalahoe*, or **Law of the Splintered Paddle.** It declared that civilians — farmers, families, the defenseless — must be protected, even in times of war. This was a profound statement of justice and restraint, born from Kamehameha’s own battlefield experience. It symbolized a vision of sovereignty that safeguarded the vulnerable, not just consolidated power.  \n\nBut the unification also came at a cost. Power became centralized in a monarchy. Local autonomy diminished. What had once been many small sovereignties was now concentrated in one throne. That centralization made the kingdom more legible — and more vulnerable — to foreign empires.  \n\nSo when American businessmen and missionaries, backed by U.S. marines, overthrew Queen Liliʻuokalani in 1893, the entire kingdom fell in one blow. A few decades later, annexation and statehood sealed the loss.  \n\nKamehameha’s unification was both a blessing and a curse: stability and law, but also fragility. Strength, but also centralization.  \n\n---\n\n## Anger Without Blueprint, Caution Without Vision\n\nThat paradox echoed in the debates I heard at U.H.  \n\nTrask embodied the anger of dispossession. Her speeches gave voice to centuries of loss. She spoke truth — but sovereignty, as she articulated it, often lacked a practical blueprint. It was anger without a map forward.  \n\nTwigg-Smith embodied caution. His words reflected pragmatism, stability, the need to adapt to the world as it is. But in dismissing sovereignty as impractical, he ignored the living wound of injustice. His proof came at the cost of vision.  \n\nBoth perspectives were partial. I couldn’t side fully with either. And in those days, sovereignty seemed like an unsolvable riddle — something to be mourned or shouted about, but not lived.  \n\n---\n\n## The Cypherpunks in the Background\n\nMeanwhile, though I didn’t know it at the time, another conversation was happening an ocean away.  \n\nOn obscure mailing lists and IRC channels, a group calling themselves the **cypherpunks** were debating privacy, cryptography, and digital freedom. They were technical, abstract, sometimes paranoid. They weren’t talking about Hawaiian sovereignty — but they were circling the same theme: **How do human beings remain free in the face of empire?**  \n\nBack then, their discussions were just theory. They didn’t yet have the tool to back it up. Like Trask, they could shout “freedom,” but they didn’t yet have proof.  \n\n---\n\n## Bitcoin as the Bridge\n\nDecades later, that tool arrived. Bitcoin.  \n\nBitcoin unites the strands that tugged at me back then:  \n- It is not theater.  \n- It is not nostalgia.  \n- It is not abstract theory.  \n\nIt is math, proof, incorruptible consensus.  \n\nWhere Trask gave voice to dispossession, Bitcoin gives a tool of self-determination.  \nWhere Twigg-Smith argued for stability, Bitcoin provides it through sound money immune to inflation and confiscation.  \nWhere the cypherpunks scribbled abstractions, Bitcoin incarnates their vision in a living system.  \n\nBitcoin is the bridge between anger and proof.  \n\n---\n\n## A Different Vision of Sovereignty\n\nLooking back, I can see it clearly now:  \n- **Haunani-Kay Trask** embodied the anger of dispossession.  \n- **Thurston Twigg-Smith** embodied the caution of pragmatism.  \n- **The cypherpunks** embodied the abstraction of math.  \n\nAll three carried fragments of truth.  \n\nAnd Bitcoin unites them — turning anger into proof, sovereignty into something we can live.  \n\nSovereignty doesn’t need a flag or a throne. It doesn’t need violent overthrow, nor does it mean exchanging Washington for another bureaucracy in Honolulu.  \n\nTrue sovereignty is not about who collects the taxes. It is about whether we can live free of dependency.  \n\nThat’s what Hawaiian sovereignty movements of the ’80s and ’90s were missing, what the cautious voices of the establishment couldn’t see, and what the cypherpunks were still dreaming about.  \n\nNow, with Bitcoin, it’s possible.  \n\n---",
  "created_at": 1763253907,
  "id": "0e35cb1d517f27cf70481c6b33435cc79c63c579b7c504a8350a3c76fd1a7d0e",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "1654230925aa21487f9179e7cb6306d21f3cf9d15198b070623a9822d0cbe232be1b14e14f5ad5646c96662f93592072cfde848555ac180168990b6184c04b50",
  "tags": [
    [
      "d",
      "from-anger-to-proof-a-journey-with-sovereignty-hawaii-and-bitcoin"
    ],
    [
      "title",
      "From Anger to Proof: A Journey with Sovereignty, Hawai‘i, and Bitcoin"
    ],
    [
      "published_at",
      "1763253907"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "In the late 1980s and early 1990s, while finishing my Physics/Math degree and beginning graduate studies in Electrical Engineering at the University of Hawai‘i, I encountered the Hawaiian sovereignty movement firsthand. I listened to Haunani-Kay Trask’s fiery speeches, read Thurston Twigg-Smith’s *Sovereignty: Do the Facts Matter?*, and felt caught between anger without blueprint and caution without vision.    At the same time, the cypherpunks were beginning to write about cryptography and freedom on obscure mailing lists. Their words were abstract then — but decades later, Bitcoin transformed them into proof.    This essay traces my journey from those days at U.H. to the present, showing how Bitcoin unites Trask’s cry, Twigg-Smith’s caution, and the cypherpunks’ math — turning anger into proof and sovereignty into something we can finally live."
    ],
    [
      "display_date",
      "2025-08-16"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "hawaii"
    ],
    [
      "t",
      "phyics"
    ],
    [
      "t",
      "cypherpunks"
    ],
    [
      "t",
      "freedom"
    ],
    [
      "e",
      "1f47bf8f9bc60ef894a2789bac09103d4868c1f59792dcbd7e0580195f2e6bef",
      "edit"
    ]
  ],
  "_source": [
    "wss://nos.lol",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nostr.bitcoiner.social",
    "wss://relay.damus.io"
  ]
}