{
  "content": "Andrew G. Stanton - Dec. 28, 2025\n\nAs we turn our faces toward a new year, we do not do so empty-handed or uncertain of who goes before us.\n\nThe Lord has already spoken over the days ahead.\n\n“Trust in the Lord with all your heart,  \nand do not lean on your own understanding.  \nIn all your ways acknowledge Him,  \nand He will make straight your paths.”  \n— Proverbs 3:5–6\n\nMay 2026 be a year in which you are not driven by fear or hurried by comparison, but steadied by trust. May you walk without needing to see the whole road, confident that the One who calls you also directs your steps.\n\n“The Lord bless you and keep you;  \nthe Lord make His face shine upon you and be gracious to you;  \nthe Lord lift up His countenance upon you and give you peace.”  \n— Numbers 6:24–26\n\nMay peace guard your heart and your mind — not the fragile peace of perfect circumstances, but the peace that comes from knowing you are kept. May grace meet you in both strength and weakness, and may rest no longer feel like failure but obedience.\n\n“Forget the former things;  \ndo not dwell on the past.  \nSee, I am doing a new thing!  \nNow it springs up; do you not perceive it?”  \n— Isaiah 43:18–19\n\nMay the new work God is doing in you and through you not be rushed or forced. May you have eyes to perceive it even when it is small, hidden, or still unfolding. May patience protect what hope is growing.\n\n“And let us not grow weary of doing good,  \nfor in due season we will reap, if we do not give up.”  \n— Galatians 6:9\n\nMay you not grow weary in faithfulness. May the quiet good you do — unseen, uncelebrated, and slow — bear fruit in its proper time. May endurance be met with renewal, and waiting with trust.\n\n“For I know the plans I have for you, declares the Lord,  \nplans for welfare and not for evil,  \nto give you a future and a hope.”  \n— Jeremiah 29:11\n\nGo into 2026 with hope — not because everything is clear, but because God is faithful. Go knowing that the Lord goes before you and stands behind you. Go assured that the work of His hands does not fail.\n\nMay you walk humbly.  \nMay you rest confidently.  \nMay you hope steadfastly.\n\nAnd may the grace of the Lord Jesus Christ,  \nthe love of God,  \nand the fellowship of the Holy Spirit  \nbe with you — in every season of the year ahead.\n\nAmen.",
  "created_at": 1766870213,
  "id": "123077f2172fe87f2079ad88cad8dc6d7447aab7a085d653779bb09306990b38",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "88c17b1f3cc1c1f0d1f7d2e2906ebc16c2f15d93a594a1d5f9ea693cfc39259ffd5e688b6b2f72d1444ff53206a3e72002384d0f46e1a7256286c2189c3ec1a1",
  "tags": [
    [
      "d",
      "sunday-article-dec-28-2025-a-benediction-for-2026"
    ],
    [
      "title",
      "Sunday Article (Dec. 28, 2025): A Benediction for 2026"
    ],
    [
      "published_at",
      "1766870213"
    ],
    [
      "client",
      "Continuum-Pro-localhost"
    ],
    [
      "summary",
      "A Scripture-rooted blessing for the year ahead, offered in hope, trust, and confidence in the Lord’s faithfulness."
    ],
    [
      "display_date",
      "2025-12-28"
    ],
    [
      "image",
      "https://2025.mycontinuum.xyz/archive/pro/nostr/npub19wvckp8z58lxs4djuz43pwujka6tthaq77yjd3axttsgppnj0ersgdguvd/images/2025-12-27-generated-weekend-set.jpg"
    ],
    [
      "t",
      "benediction"
    ],
    [
      "t",
      "blessing"
    ],
    [
      "t",
      "new year"
    ],
    [
      "t",
      "2026"
    ],
    [
      "t",
      "hope"
    ],
    [
      "t",
      "scripture"
    ],
    [
      "t",
      "god"
    ],
    [
      "t",
      "sunday"
    ],
    [
      "e",
      "25ee1c46a891ca18b7fa494b78cbee1ba5bd15ed76d1d9bc638fc3af35620ee3",
      "edit"
    ]
  ],
  "_source": [
    "wss://nos.lol",
    "wss://nostr.mom",
    "wss://nostr.bitcoiner.social",
    "wss://relay.snort.social",
    "wss://offchain.pub",
    "wss://relay.damus.io"
  ]
}