{
  "content": "Andrew G. Stanton - May 22, 2025\n\n“Huge swathes of people…spend their entire working lives performing tasks they secretly believe do not really need to be performed.”\n— *David Graeber, Bullshit Jobs*\n\n“We are in a system that must grow — forever — or it collapses. But technology, by its very nature, is deflationary.”\n— *Jeff Booth, The Price of Tomorrow*\n\nWe live in a strange paradox: Technological progress is supposed to make life easier, yet many people feel more overworked and less fulfilled than ever. While artificial intelligence and automation promise unprecedented productivity, it’s not yet clear whether that will mean fewer bullshit jobs — or simply new kinds of them.\n\n### What Is a Bullshit Job?\n\nIn his landmark book *Bullshit Jobs*, the late anthropologist David Graeber exposed a haunting truth: millions of jobs exist not because they are needed, but because of economic, political, or psychological inertia. These are roles that even the workers themselves suspect are meaningless — created to serve appearances, maintain hierarchies, or justify budgets.\n\nThink:\n\n* Middle managers approving other middle managers' reports\n\n* Employees running meetings to prepare for other meetings\n\n* Corporate roles invented to interface with poorly implemented AI tools\n\nBullshit work isn’t the absence of technology. It’s often the **outcome of resisting** what technology could actually do — in order to preserve jobs, status, or growth targets.\n\n### Booth’s Warning: The System is Rigged Against Deflation\n\nIn *The Price of Tomorrow*, entrepreneur Jeff Booth argues that the natural state of a tech-driven economy is **deflation** — things getting better, cheaper, and faster.\n\nBut our global financial system is built on **perpetual inflation** and debt expansion. Booth writes:\n\n\\&gt; “We are using inflationary monetary policy to fight deflationary technological forces.”\n\nEven as AI and automation *could* eliminate unnecessary jobs and increase abundance, our system *requires* jobs — or the illusion of them — to keep the economy expanding. So bullshit jobs persist, and even evolve.\n\n### AI as a Deflationary Force\n\nAI is rapidly accelerating the deflation Booth described:\n\n* Tasks that used to take hours now take seconds\n\n* Whole creative and administrative processes are being streamlined\n\n* Labor can scale digitally — one tool used globally at near-zero marginal cost\n\nEmbraced honestly, this could mean fewer hours, lower costs, and *more* prosperity. But again, we are not optimized for truth — we are optimized for GDP growth.\n\nSo we invent new layers of AI-enhanced bullshit:\n\n* Prompt engineers writing prompts for other prompt engineers\n\n* \"Human-in-the-loop\" validators reviewing AI output they don’t understand\n\n* Consultants building dashboards that nobody reads\n\n### Toward a Post-Bullshit Future\n\nHere’s the real opportunity: If we embrace deflation as a blessing — not a threat — and redesign our systems around **truth, efficiency, and abundance**, we could:\n\n* Eliminate meaningless labor\n\n* Reduce the cost of living dramatically\n\n* Liberate people to create, heal, build, and rest\n\nThis means more than economic reform — it’s a philosophical shift. We must stop equating “employment” with value. That’s where Bitcoin and open-source tools point: toward a world where permissionless value creation is possible without the bloat of gatekeeping institutions.\n\n### Final Thought: Tech Won’t Save Us, But Truth Might\n\nTechnology, left to its own logic, tends toward freedom, efficiency, and abundance. But our current systems suppress that logic in favor of growth at all costs — even if it means assigning millions of people to do work that doesn’t need doing.\n\nSo will AI eliminate bullshit jobs?\n\n**It can. But only if we stop pretending we need them.**\n\nAnd for those of us who step outside the wage-work loop, something remarkable happens. We begin using these tools to **create actual value** — not to impress a boss, but to solve real problems and serve real people.\n\nRecently, I built a tool using AI and automation that helps me cross-post content from Nostr to LinkedIn, Facebook, and X. It wasn’t for a paycheck. It was about leverage — freeing time, expanding reach, and creating a public record of ideas.\\\nYou can check it out here:\\\n👉 <<https://tinyurl.com/ywxuowl5>>\n\nWill it help others? I don’t know yet.\\\nBut it helped me — and that’s the point.\n\nReal value creation doesn’t always begin with a business plan. Sometimes it starts with **curiosity, conviction, and the courage to build without permission.**\n\nMaybe the future of work isn’t about scaling jobs at all.\\\nMaybe it’s about reclaiming time — and using these tools to build lives of meaning.\n\n***\n\nIf this resonates — or if you’ve found your own way to reclaim time and create value outside the wage loop — zap me and share your story. Let’s build the *post-bullshit economy* together. ⚡",
  "created_at": 1763187642,
  "id": "1741addb41d74fb823c17f2071ffabc32229d1d51eabcbafe45ff47c5d2c1cba",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "0920575cf3727169f853dea335f3b0f281a97174a5ad47aafcecabdb1d333c513cbfed5c97136a3bacff4d65f206e626bcaf592919897b5fd518d2cd99c8351e",
  "tags": [
    [
      "d",
      "will-ai-and-automation-create-more-bullshit-jobs-—-or-eliminate-them?"
    ],
    [
      "title",
      "Will AI and Automation Create More Bullshit Jobs — or Eliminate Them?"
    ],
    [
      "published_at",
      "1763187642"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "This article explores whether AI and automation will eliminate or multiply “bullshit jobs” — roles that even workers consider meaningless, as described by David Graeber. Drawing on Jeff Booth’s The Price of Tomorrow, it argues that technology is naturally deflationary and could free us from pointless labor. However, our inflation-driven economic system incentivizes the creation of unnecessary jobs to sustain growth. The piece concludes by advocating for a shift toward truth, value creation, and permissionless work — including a personal example of building a cross-posting tool using AI, not for a paycheck, but for real leverage and impact."
    ],
    [
      "display_date",
      "2025-05-22"
    ],
    [
      "image",
      "https://blossom.primal.net/d569b8856a448c27eb8a7d9bb9834b749b4b48519a8c4a040c829aac0ad87737.png"
    ],
    [
      "t",
      "AI"
    ],
    [
      "t",
      "Automation"
    ],
    [
      "t",
      "BullshitJobs"
    ],
    [
      "t",
      "DavidGraeber"
    ],
    [
      "t",
      "JeffBooth"
    ],
    [
      "t",
      "ThePriceOfTomorrow"
    ],
    [
      "t",
      "Bitcoin"
    ],
    [
      "t",
      "ProofOfWork"
    ],
    [
      "t",
      "Deflation"
    ],
    [
      "t",
      "Permissionless"
    ],
    [
      "t",
      "FutureOfWork"
    ],
    [
      "t",
      "BuildWithoutPermission"
    ],
    [
      "t",
      "Nostr"
    ],
    [
      "t",
      "ZapLife"
    ],
    [
      "t",
      "DigitalAbundance"
    ],
    [
      "e",
      "83829a43e2db89ddd173aebc519c251af6a403d8dc13578598c68ff289bd12a7",
      "edit"
    ]
  ],
  "_source": [
    "wss://nos.lol",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nostr.bitcoiner.social",
    "wss://relay.damus.io"
  ]
}