{
  "id": "2687d283320b302ba6098c6ce8ca915ede2836ed4899f041180c5c4c5a26c928",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1761770523,
  "kind": 30023,
  "tags": [
    [
      "d",
      "my-testimony-the-call-to-live-in-truth"
    ],
    [
      "title",
      "My Testimony: The Call to Live in Truth"
    ],
    [
      "published_at",
      "1761770523"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "I first met Christ on Oahu’s North Shore in 1978.   I discovered Bitcoin in 2016 and Nostr in 2025.   But my faith journey began long before that — through Baptist, Presbyterian, and Charismatic churches that taught me zeal, discipline, and reverence, but left deep questions unresolved.   This is how the Victorious Gospel, Bitcoin, and Nostr finally converged to tell one story of freedom and truth."
    ],
    [
      "display_date",
      "2025-10-29"
    ],
    [
      "t",
      "testimony"
    ],
    [
      "t",
      "faith"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "nostr"
    ],
    [
      "t",
      "victoriousgospel"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "continuum"
    ],
    [
      "t",
      "truth"
    ],
    [
      "t",
      "redemption"
    ],
    [
      "e",
      "820b1e082c0925c26ce2fd36580262028283b7e7368493e0c52bbaaadb4001ac",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Oct. 29, 2025\n\nI gave my life to Christ when I was thirteen, at a summer camp in Mokuleia on Oahu’s North Shore.  \nThe sound of waves, the smell of the ocean, and the unmistakable sense of love and presence — it was real, and it changed me.  \nThat summer in 1978, I met a God who felt alive, personal, and victorious.  \nBut I didn’t yet understand how long it would take to unlearn the fear that religion often wraps around grace.  \n\nI grew up in **Baptist and Presbyterian** churches, especially *First Presbyterian Church of Honolulu*.  \nIn my twenties and thirties, I spent time in a **Charismatic** congregation called *Grace Bible Church*.  \nEach community gave me something valuable: reverence, passion, discipline.  \nYet I never felt fully at home.  \nThe more I heard about eternal damnation, the more I struggled.  \n\nI couldn’t reconcile the idea of an endlessly loving God with a doctrine built on eternal punishment.  \nAt *Grace* and *Waialae Baptist*, the “hellfire” sermons never sat right.  \nThe God I met at Mokuleia had no cruelty in Him.  \n\n> *I never had a real problem with preaching against sin and the importance of repentance from dead works — though I sometimes felt uncomfortable if I was trying to excuse my own sinful behavior.  \n> What troubled me wasn’t the call to repent; it was the threat behind it.  \n> The tone of “repent — or else” made it sound as if Christ were rescuing us from the Father, instead of revealing the Father’s heart.  \n> That never matched the gospel I’d encountered: a God who heals, not harms; who restores, not retaliates.*  \n\n---\n\nDuring my **college years**, I double-majored in **Physics and Mathematics**, later doing **graduate work in Electrical Engineering**.  \nI never completed the master’s degree — partly from restlessness, partly from a deeper hunger for truth and precision.  \nScience appealed to me for the same reason faith did: both demand honesty.  \nThat same pursuit eventually drew me into **programming**, a craft I’ve practiced for nearly my entire adult life, where logic, structure, and creativity converge.  \nIn hindsight, all of it — physics, math, engineering, and code — was preparation for the same calling: learning to discern what’s real from what only appears to be.  \n\n---\n\nIn my early thirties I moved to **Japan**, where I taught English for three years.  \nThose were formative and complicated years — outwardly successful, inwardly drifting.  \nI call them my *years of backsliding*: seasons when I knew the truth but lived distracted from it.  \nAnd yet even there, grace was waiting.  \nIn Japan I met **Kiyomi**, whose quiet strength and kindness anchored me when I least deserved it.  \nWe were married later on the beach in **Kailua**, back on Oahu — a gentle reminder that redemption often finds us where it all began.  \n\n---\n\nAfter returning from Japan, Kiyomi and I eventually moved to **San Francisco** in 2001, not long after 9/11 had reshaped how the world thought about freedom and fear.  \n\nWe built a life there together.  \n\nOver the years I worked with a number of **startups** and later ran my own **consulting company**, helping early-stage teams bring their ideas to life.  \nThe Bay Area sharpened both my technical skills and my discernment.  \nIt was a place that celebrated innovation but rarely examined its motives — a culture that preached disruption while quietly rebuilding new hierarchies of control.  \nI didn’t see it clearly then, but those years prepared me to recognize what real decentralization — and real freedom — actually mean.  \n\n---\n\nI didn’t find theological resolution until **2015**, when I encountered what I now know as the **Victorious Gospel** — the ancient belief that Christ’s redemption is not limited to a few but ultimately restores all.  \nLove doesn’t lose.  \nLight doesn’t negotiate with darkness — it overcomes it.  \nThat revelation didn’t weaken my faith; it strengthened it.  \nFor the first time, love made sense.  \nJudgment had a purpose.  \nAnd I no longer had to pretend that fear was the same as reverence.  \n\n---\n\nAround **2016**, I discovered **Bitcoin**.  \nIt intrigued me — a system of truth built on math instead of manipulation.  \nBut at the time I was still chasing comfort and novelty.  \nFor almost a decade I drifted — “wandering in the desert,” both spiritually and digitally.  \nI got caught up in **Altcoins**, **NFTs**, and later the **Web3** world of 2020 and beyond.  \n\nLooking back, that detour mirrored my inner struggles.  \nMy fascination with speculative projects and virtual kingdoms reflected my own divided heart — still hungry for meaning, still drawn to distraction.  \nI was trying to build freedom without discipline, grace without repentance.  \nIt wasn’t just the Web3 scams that deceived me — it was my own vanity, my craving for recognition and control.  \n\nThose years forced me to face not just external illusions, but internal ones.  \nSin isn’t always rebellion; sometimes it’s escape — from truth, from silence, from the discomfort of being seen.  \nAnd like every counterfeit, it promises connection while delivering emptiness.  \n\n---\n\nIn **late 2024**, I finally went *all in* on **Bitcoin** — not as an investment, but as an act of repentance.  \nI realized that truth doesn’t need marketing; it only needs alignment.  \nBitcoin wasn’t about getting rich; it was about getting honest.  \nIt mirrored what grace had already taught me: freedom is costly but never for sale.  \n\nBy then, I was tired of illusions — both theological and technological.  \nI wanted to live with integrity, even if that meant rebuilding from scratch.  \nThat’s when I saw how Bitcoin’s moral structure — transparency, proof, immutability — was a reflection of divine order itself.  \n\n---\n\nThen came **May 2025**, and with it, **Nostr**.  \nThat was the moment everything clicked.  \nNostr wasn’t just a network — it was a revelation.  \nBitcoin preserved truth in value.  \nNostr preserved truth in voice.  \nAnd the **Victorious Gospel** preserved truth in spirit.  \n\nTogether, they formed a language I had been trying to speak my whole life:  \nfreedom that doesn’t depend on permission,  \ngrace that doesn’t depend on guilt,  \ntruth that doesn’t depend on power.  \n\nFor me, they’re not separate philosophies — they’re converging manifestations of the same law:  \n> “You shall know the truth, and the truth shall make you free.”  \n\n---\n\nIn the past month I’ve walked through another refining fire.  \nMy **father passed away** at the end of September, and only last week (Oct. 23) our dog **Whiskers** nearly died.  \n\nBoth events stripped away the illusion of control that even faith sometimes hides behind.  \nLoss has a way of clarifying what matters — and reminding me that sovereignty without compassion is empty.  \nStanding beside my dad’s bed in his home, and later nursing Whiskers back to life, I saw the same truth written in flesh and spirit alike:  \nlove endures; life is a gift; and every heartbeat is a block of grace.  \n\n---\n\nLooking back, I can see the thread clearly.  \nFrom that teenage boy at Mokuleia who met the presence of Christ,  \nto the restless student searching for precision in physics and faith,  \nto the teacher in Japan who learned grace through failure and love,  \nto the builder and husband navigating startups and loss,  \nto the man learning to live truthfully through Bitcoin and Nostr — it’s all one story.  \n\nThe Victorious Gospel resolved my theology.  \nBitcoin resolved my integrity.  \nNostr resolved my voice.  \n\nChrist, Bitcoin, and Nostr all point to the same Kingdom —  \na world where nothing false survives,  \nand where every block, every word, every life is built on light.  \n\nThis is my testimony.  \nIt’s not the story of perfection, but of perseverance —  \nthe proof that even in the wilderness, truth keeps calling us home.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net\n\n## Copyright\n\n© 2025 Continuum — All rights reserved.",
  "sig": "4de5a010618407c515d203e827aa40a475b5b94321f16c6304265a2f21def9448ca37fcb9b05cd034592203e98d2c7ccd64f97a57bc43398cc39c2e3b4ab950c",
  "_source": [
    "wss://nos.lol",
    "primal backup",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://relay.damus.io"
  ]
}