{
  "id": "26de60c9403b6f2d451d9b28540abe5159cb952ed41d1fa9a87151748f86817f",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1758698666,
  "kind": 30023,
  "tags": [
    [
      "d",
      "sunday-article-sept-21-2025-in-christ-shall-all-be-made-alive"
    ],
    [
      "title",
      "Sunday Article (Sept. 21, 2025): In Christ Shall All Be Made Alive"
    ],
    [
      "published_at",
      "1758698666"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "Death is an enemy, but it has been defeated. Resurrection hope is the foundation of low time preference: we build cathedrals, code, and legacies because we know that life in Christ continues beyond death."
    ],
    [
      "display_date",
      "2025-09-21"
    ],
    [
      "t",
      "resurrection"
    ],
    [
      "t",
      "faith"
    ],
    [
      "t",
      "lowtimepreference"
    ],
    [
      "t",
      "hope"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "sunday"
    ],
    [
      "e",
      "fa24b3cda846ef9e1621241d5a5ef0fdffda1826bf1e8b58a98098404510a3c7",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Sept. 21, 2025\n\nThe resurrection is the hinge of history. Without it, faith is vanity. With it, death is defeated, life is eternal, and every act of building takes on new meaning.\n\nPaul declared, “For as in Adam all die, so in Christ shall all be made alive” (1 Cor. 15:22). Death is not denied but redefined. It remains an enemy, but a defeated one. Its sting is gone. Its victory is hollow. For the believer, mortality is not annihilation but transformation.\n\nThis hope shapes time preference. If death is final, urgency rules. Consumption makes sense. Hedonism becomes rational. But if resurrection is real, patience is possible. Builders can invest in projects that outlast them. Parents can sacrifice for children they will never meet. Writers can plant ideas that bloom long after they are gone. Cathedral builders can lay stones for spires they will never see. Bitcoiners can hold wealth not for themselves but for generations.\n\nFiat culture rejects resurrection. It denies eternity. It consumes today and fears tomorrow. But resurrection reorders everything. It frees us to laugh at death, to mock it, to live defiantly in hope. It makes every act of sovereignty—every decision to live in truth and kindness—an act of resistance against the lie of finality.\n\nBitcoin aligns with this resurrection ethic. It resists decay, refuses debasement, and endures across generations. To invest in Bitcoin is to confess faith in the future, to align one’s life with truths that outlast death. It is not eternal life, but it is incorruptible money—an echo of incorruptible hope.\n\nIn Christ, all are made alive. That is the foundation. That is the freedom. Death does not have the final word. Christ does. And in that freedom, we live, build, and hope.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net",
  "sig": "75df058fc71fbf0bf43bcbf0166088f64e290c5fc3c3b6122d10ebed57d661b85072e0eb294e3fe6d6e7242621d72cfe6f5cba21a35c7720a4dd21f6da882a22",
  "_source": [
    "primal backup",
    "wss://nostr.bitcoiner.social"
  ]
}