{
  "content": "Andrew G. Stanton Dec. 27, 2025\n\nI want to be very clear about something, because it’s easy to misunderstand my position.\n\nI care deeply about reach.\nI care about growth.\nI care about virality.\nI care about people finding the work.\n\nWhat I don’t accept is the way these forces have been **perverted** by modern platforms.\n\n### Growth is a real and important phenomenon\n\nGrowth is not artificial. It’s not a trick. It’s not inherently manipulative.\n\nIdeas spread.\nStories resonate.\nTruth travels.\nPeople share what moves them.\n\nThroughout history, the most important ideas — religious, scientific, political, artistic — spread because they *deserved* to spread. They found audiences organically, often long before there were institutions capable of managing or monetizing that spread.\n\nVirality, in its natural form, is simply **human propagation**.\n\n### Where things went wrong\n\nThe problem began when platforms stopped treating growth as something that *happens* and started treating it as something to **own**.\n\nIn the modern platform model:\n- Growth is mediated by algorithms\n- Reach is rationed\n- Visibility is conditional\n- Amplification is a lever pulled by the platform, not the creator\n\nCreators are told they are “building an audience,” but in reality they are feeding a system they do not control.\n\nThey don’t decide:\n- how their work is distributed\n- who sees it\n- when it spreads\n- why it stops spreading\n- what kinds of work are rewarded or suppressed\n\nThose decisions live upstream, inside systems optimized for engagement extraction, ad inventory, and behavioral shaping.\n\nThe creator becomes the thing being sold.\n\n### The inversion that matters\n\nThis is the inversion I reject:\n\n**Creators should not be subordinate to growth systems.  \nGrowth systems should be subordinate to creators.**\n\nIn most modern platforms, the relationship is reversed.\n\nThe platform sits in the driver’s seat.\nThe creator adapts.\nThe work adapts.\nEventually, the creator’s thinking adapts too.\n\nThis is not accidental. It’s structural.\n\nWhen a platform controls growth, it controls incentives. And when incentives are controlled externally, authorship becomes conditional.\n\n### Why ownership has to come first\n\nThe only way to correct this inversion is to restore ownership and authorship *before* amplification.\n\nThat means:\n- The creator owns the work\n- The creator controls drafts, publication, and access\n- The creator decides when and how something is released\n- Growth and reach are added deliberately — not imposed\n\nThis doesn’t eliminate virality.\nIt **civilizes** it.\n\nGrowth becomes something that serves the work, not something that reshapes it.\n\n### A cathedral, not a feed\n\nI often think of this difference architecturally.\n\nModern platforms are optimized like feeds:\n- infinite scroll\n- constant stimulation\n- interchangeable content\n- attention as the primary currency\n\nWhat I’m trying to build is closer to a cathedral.\n\nCathedrals still fill.\nThey still attract people.\nThey still create moments of awe and shared experience.\n\nBut none of that comes at the expense of the structure itself.\n\nThe foundation is laid first.\nOwnership is clear.\nAuthority comes from integrity, not metrics.\n\nArt, light, sound, and gathering are integrated — but they do not govern the building.\n\n### The goal is not less growth — it’s rightful growth\n\nI’m not trying to shrink the reach of creators.\nI’m trying to return agency to them.\n\nI want growth that:\n- amplifies without distorting\n- spreads without extracting\n- reaches without owning\n\nThat requires systems where creators are not tenants on someone else’s land, hoping the algorithm is kind today.\n\nIt requires putting authors back in the driver’s seat.\n\nGrowth matters.\nVirality matters.\nReach matters.\n\nBut only when they serve the work — not when they own it.",
  "created_at": 1766904780,
  "id": "2a05965f9a63c2a716740d1da850c7486b3d2a1b379e7eb81984827b4a3a1b52",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "1b0f8c6a356722338330f4554cf9d88387cae5a47bd4420a30b07b79a737d4fc77c549cb95fb0eecc20547d7339da72464ac74bd9b416b32df0c534150484cd6",
  "tags": [
    [
      "d",
      "growth-is-not-the-enemy--control-is"
    ],
    [
      "title",
      "Growth Is Not the Enemy — Control Is"
    ],
    [
      "summary",
      "Virality, reach, and growth are not inherently bad. They are powerful forces that can amplify truth, creativity, and human connection. The problem with modern platforms is not growth itself, but the way growth has been inverted into a mechanism of control — where creators become the product and platforms decide how amplification happens. This piece clarifies that distinction, and why it matters."
    ],
    [
      "published_at",
      "1766904780"
    ],
    [
      "client",
      "Continuum-Pro-localhost"
    ],
    [
      "t",
      "growth"
    ],
    [
      "t",
      "virality"
    ],
    [
      "t",
      "creators"
    ],
    [
      "t",
      "platforms"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "publishing"
    ],
    [
      "t",
      "ownership"
    ],
    [
      "display_date",
      "2025-12-27"
    ],
    [
      "image",
      "https://2025.mycontinuum.xyz/archive/pro/nostr/npub19wvckp8z58lxs4djuz43pwujka6tthaq77yjd3axttsgppnj0ersgdguvd/images/2025-12-27-generated-continuum-cathedral.jpg"
    ]
  ],
  "_source": [
    "wss://relay.damus.io",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nostr.bitcoiner.social",
    "wss://nos.lol"
  ]
}