{
  "id": "3e06f3b82c2236db9e66d96de37f18d91d8e3a9c595a850b32ecc8be49df9e60",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1763007842,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-2-nov-11-2025-building-for-the-ones-who-come-after"
    ],
    [
      "title",
      "Free Article 2 (Nov. 11, 2025): Building for the Ones Who Come After"
    ],
    [
      "published_at",
      "1763007842"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "A reflection on marriage, legacy, and the slow architecture of love — what it means to build something that endures beyond our own lifetime."
    ],
    [
      "display_date",
      "2025-11-11"
    ],
    [
      "t",
      "continuum"
    ],
    [
      "t",
      "faith"
    ],
    [
      "t",
      "marriage"
    ],
    [
      "t",
      "legacy"
    ],
    [
      "t",
      "creation"
    ],
    [
      "t",
      "hope"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "4b6bd5de3e18440983bd0936277ee0a17fe94f862533e6312618f324c2c5810a",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Nov. 11, 2025\n\nWhen you have walked together for twenty-five years, time stops feeling like a line.  \nIt becomes a structure — a home built from seasons, memories, and unfinished prayers.  \nEvery laugh and every argument, every risk and every reconciliation, turns into another beam holding the weight of what you’ve built together.\n\nI think often now about what it means to *build for the ones who come after.*  \nWhen Kiyomi and I first began, everything was about survival — paying rent, staying afloat, trying to prove we could make something of ourselves.  \nBut somewhere between the early years of noise and the quiet moments that followed, our labor began to take on a different tone.  \nWe weren’t just trying to stay alive.  \nWe were shaping the soil so others could plant.\n\nThere’s a line in Proverbs that says, *“By wisdom a house is built, and through understanding it is established.”*  \nWisdom isn’t cleverness.  \nIt’s the lived patience that sees the unseen — the discipline to prepare a foundation for someone else’s joy.  \nThat’s marriage at its truest: a lifetime apprenticeship in understanding.  \nNot the understanding that ends debate, but the kind that makes room for mystery.  \nThe kind that says, “I don’t have to win; I only have to stay.”\n\nWhen I look at the younger generation — the ones chasing speed, platforms, and digital approval — I ache for them, but I also understand.  \nThe world we built is louder than the one we inherited.  \nThey are trying to find quiet in the chaos.  \nPerhaps what we can offer isn’t advice but example: the slow faith of two people who kept showing up.  \nLove that outlasts the algorithm is still possible.\n\nI’ve realized that everything meaningful in life takes the shape of stewardship.  \nThe land you keep, the words you write, the children or friends you nurture — all are extensions of the same vow:  \n*I will leave this better than I found it.*  \nIt’s the first law of creation and the last act of faith.\n\nThere were years when I thought “building legacy” meant accumulating achievements.  \nNow I see that the truer legacy is *continuity* — keeping the flame when the world goes dark.  \nIt’s handing forward a pattern of faithfulness.  \nIf Continuum has any real purpose, it is to give others a way to remember who they are — to own their words, to keep their witness from being erased by time or trend.  \nThat same impulse built our marriage long before it became software: a refusal to let meaning dissolve into convenience.\n\nSometimes Kiyomi and I walk in the park and say nothing.  \nWe don’t need to.  \nThe silence itself is history speaking — the sound of everything we’ve built and forgiven and carried together.  \nI imagine someday, long after we’re gone, someone might read these words and feel a spark of recognition: *So this is what it looks like to last.*  \n\nThat’s enough for me.  \nTo build something that endures — not because it is perfect, but because it was made with love — is to participate in creation itself.  \nThe house of fidelity is never finished.  \nIt keeps growing, generation by generation, stone by living stone, for the ones who come after.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net\n\n## Copyright\n\n© 2025 Continuum — All rights reserved.",
  "sig": "7d805c39801c1fcc5749be7c767e611c1337097d8fef6211eeafcab0128820436a1847ff68575b930234e78e42ba5a65af5b0d941a8ab762803b6886caad6be0",
  "_source": [
    "wss://nos.lol",
    "primal backup",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nostr.bitcoiner.social",
    "wss://relay.damus.io"
  ]
}