{
  "id": "61ab1b7a16eb408044e3b282e96f4525e6f69e94fcd6316715ab8e20f30431c3",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1749407746,
  "kind": 30023,
  "tags": [
    [
      "title",
      "Freedom Means Honoring People — Even When We Disagree"
    ],
    [
      "summary",
      "In an age of polarization, this reflection explores what true freedom looks like: not agreement at all costs, but the capacity to honor people — even when we profoundly disagree. From Chelsea Manning and Edward Snowden to Ross Ulbricht and Donald Trump, the piece wrestles with moral complexity, hypocrisy, and the double-edged sword of modern power. It closes with a hopeful look at Bitcoin — a system built on neutrality and permissionlessness — as a model for principled freedom that transcends party lines and culture wars."
    ],
    [
      "image",
      "https://blossom.primal.net/5dd0754353e6711b68f08529f57ac96b46a7874bc8040073f417a6c622523c43.png"
    ],
    [
      "d",
      "freedom-means-honoring-people-—-even-when-we-disagree"
    ],
    [
      "t",
      "Bitcoin"
    ],
    [
      "t",
      "Freedom"
    ],
    [
      "t",
      "Edward Snowden"
    ],
    [
      "t",
      "Ross Ulbricht"
    ],
    [
      "t",
      "Chelsea Manning"
    ],
    [
      "t",
      "Political Tension"
    ],
    [
      "t",
      "Surveillance"
    ],
    [
      "t",
      "Moral Complexity"
    ],
    [
      "t",
      "Truth and Justice"
    ],
    [
      "t",
      "Permissionless Systems"
    ],
    [
      "t",
      "Border Policy"
    ],
    [
      "t",
      "Christian Perspective"
    ],
    [
      "t",
      "Liberty and Responsibility"
    ],
    [
      "t",
      "Postpartisan Thinking"
    ],
    [
      "t",
      "Hypocrisy and Integrity"
    ],
    [
      "r",
      "wss://purplepag.es/"
    ],
    [
      "r",
      "wss://eden.nostr.land/"
    ],
    [
      "r",
      "wss://nostr-pub.wellorder.net/"
    ],
    [
      "r",
      "wss://relay.nostr.band/"
    ],
    [
      "r",
      "wss://nostr.land/"
    ],
    [
      "r",
      "wss://nostr.mom/"
    ],
    [
      "r",
      "wss://nostrelites.org/"
    ],
    [
      "r",
      "wss://premium.primal.net/"
    ],
    [
      "r",
      "wss://puravida.nostr.land/"
    ],
    [
      "r",
      "wss://pyramid.fiatjaf.com/"
    ],
    [
      "r",
      "wss://relay.damus.io/"
    ],
    [
      "r",
      "wss://relay.nostrplebs.com/"
    ],
    [
      "r",
      "wss://relay.primal.net/"
    ],
    [
      "r",
      "wss://relay.snort.social/"
    ],
    [
      "r",
      "wss://wot.utxo.one/"
    ],
    [
      "client",
      "Primal"
    ],
    [
      "published_at",
      "1748821793"
    ]
  ],
  "content": "This isn’t a comfortable post to write. I first composed it on Thursday night, May 29, 2025, just after the Bitcoin2025 conference — but I needed a few days to sit with it before posting.\n\nBecause freedom, if it means anything, has to include tension — not just agreement.\n\nFour names kept surfacing in conversations on Nostr and at the Bitcoin2025 conference: President Donald Trump, Chelsea Manning, Edward Snowden (who gave the keynote at Bitcoin2024), and Ross Ulbricht.\n\nI believe in truth. I believe in moral boundaries.\n\nAnd I believe people are made in the image of God — with dignity that can’t be erased by their choices.\n\nSo let me be honest: I disagree with the transgender lifestyle on a moral and theological level.\n\nBut I believe Chelsea Manning deserved to be freed after exposing military wrongdoing.\n\nI’m conflicted about Edward Snowden.\n\nI don’t see him as a hero — but I don’t believe he’s a traitor either.\n\nThe truth, as is so often the case, is far more complicated.\n\nSnowden revealed the scale of warrantless surveillance against Americans. He helped expose a shadow system of data collection and control. That matters.\n\nBut in doing so, he may also have endangered lives — disclosing classified intelligence in a way that potentially compromised undercover agents and global operations.\n\nHe’s also been largely silent during Russia’s invasion of Ukraine, and that raises hard questions.\n\nWhat truths go unspoken when your safety depends on a state with its own authoritarian tendencies?\n\nStill — I’m grateful for what he did.\n\nI’ve never met him, but I think we could’ve been friends in another world.\n\nI can like someone very much and still disagree with them about what they did.\n\nThat’s not weakness. That’s human.\n\nAnd Ross Ulbricht?\n\nI don’t think he’s entirely without fault.\n\nBut I do believe his original sentence — two life sentences without parole — was a gross miscarriage of justice.\n\nHis recent pardon by President Trump corrected something our courts never did.\n\nI admire Ross. And like with Snowden, I can hold that admiration even while acknowledging complexity.\n\nI say this as someone who voted for Trump and agrees with many of his stances.\n\nI believe in strong, secure borders.\n\nBut I also believe we need a more compassionate and streamlined process for immigration and asylum.\n\nSecurity and mercy are not opposites — we can pursue both.\n\nBut I’ll also say this:\n\nI’m troubled by some of the recent moves Trump has made.\n\nThe promotion of meme coins by Trump feels flippant and off-base when so many Americans are struggling to understand real monetary sovereignty.\n\nEven more disturbing are reports that his administration contracted with companies like Palantir to build a vast data infrastructure — the kind that could be used to track, profile, and suppress U.S. citizens.\n\nThat’s a betrayal of the very freedom we claim to defend.\n\nAnd it reveals a deeper conflict I can’t ignore:\n\nHow can we champion liberty with one hand while constructing surveillance tools with the other?\n\nThis isn’t about party.\n\nIt’s about principle.\n\nAnd if I’m honest, the one thing that’s hardest for me to tolerate — in myself or in others — is hypocrisy.\n\nNot disagreement. Not even failure.\n\nBut posturing. Pretending. Saying one thing and doing another.\n\nThat’s what corrodes trust — in politics, in faith, in freedom itself.\n\nBecause if your definition of freedom only includes people who think, live, or vote like you —\n\nit’s not freedom. It’s favoritism.\n\nBitcoin reminds me of a better standard.\n\nIt doesn’t care about your politics, background, beliefs, or identity.\n\nIt’s borderless. Neutral. Permissionless.\n\nIt just works — for everyone.\n\nBitcoin gives us a glimpse of a freer world — not perfect, but principled.\n\nA world where disagreement isn’t a threat, and dignity isn’t earned.\n\nThat’s the kind of future worth building — not with slogans, but with truth, grace, and work that lasts.\n\nZap me if this resonates.\n\nPush back if it doesn’t — that’s freedom too.\n\n\\---\n\n\\### ✍️ Acknowledgment\n\nThis piece was shaped with help from **Dr. C** (ChatGPT) to organize and clarify ideas, but the heart of it — the desire to seek truth over comfort, and to honor people over posture — comes from a deeper place.\n\nAny wisdom here I credit to the **Holy Spirit**, who leads us into all truth (John 16:13) and continues to stir the courage to speak it — even when it's uncomfortable.\n\n\\---\n\n\\### 📘 Footnote\n\nReporting confirms that the Trump administration contracted Palantir Technologies to develop large-scale federal data platforms consolidating personal information from the IRS, Social Security Administration, immigration systems, and more. Palantir also secured a $30 million contract to build “ImmigrationOS,” a surveillance tool for ICE. These systems raise serious concerns among civil liberties advocates.\n\n\\- \\[Economic Times]\\(<https://tinyurl.com/22bdv72d>)\n\n\\- \\[Immigration Policy Tracker]\\(<https://tinyurl.com/2686bgvy>)\n",
  "sig": "d20509ba7f3571dd1d8d0d96d7a3206571edd6feab4a733c2bf793dd894b51f451fd7555c0ba564cae95f064fb88ad549f830218c1eb2d3ac256e76b20aa294a",
  "_source": [
    "primal backup"
  ]
}