{
  "id": "643b197c3c6394bee47dfe459927f778781b8d28a96804d68f3dc4553828799b",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1758697100,
  "kind": 30023,
  "tags": [
    [
      "d",
      "saturday-article-sept-20-2025-the-long-goodbye-mortality-and-sovereignty"
    ],
    [
      "title",
      "Sabbath Article (Sept. 20, 2025): The Long Goodbye: Mortality and Sovereignty"
    ],
    [
      "published_at",
      "1758697100"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "When death draws close, all illusions fall away. Sovereignty at the end of life means refusing to outsource dignity to profit-driven systems and instead embracing clarity, hope, and truth. This reflection explores how facing mortality is the deepest test of freedom."
    ],
    [
      "display_date",
      "2025-09-20"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "mortality"
    ],
    [
      "t",
      "endoflife"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "faith"
    ],
    [
      "t",
      "sabbath"
    ],
    [
      "e",
      "bead0cb96a6cc9a761f1bbd6c24ebbf1ff39f9e9ce0e4cbcca08f7421b7ddeca",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Saturday, Sept 20, 2025\n\nDeath is an enemy. Yet it comes for us all. To ignore it is folly; to face it is sovereignty. Mortality strips away illusions, whether personal or cultural. At the end, possessions lose their grip, ambitions lose their fire, and what remains is the truth of who we are and what we have built.\n\nSovereignty at the end of life does not mean grasping for control. It means choosing dignity over sedation, meaning over profit-driven protocols, and hope over denial. In a fiat culture that medicates, consumes, and distracts, sovereignty means meeting mortality clear-eyed and free.\n\nThroughout history, cultures that faced death honestly also built legacies that endured. Egyptians erected pyramids as tombs. Medieval Europe built cathedrals. In both cases, builders knew they would never see the work finished. They accepted their mortality, yet they invested in something greater. This is the essence of low time preference: choosing to labor today for the benefit of generations yet unborn.\n\nModern fiat culture rejects this. It chooses debt over saving, consumption over investment, illusion over truth. End-of-life care is outsourced to systems designed to extract maximum profit by prolonging decline. The human dignity of finishing well is lost in the fog of machines and bills. Sovereignty resists this by reclaiming agency. To decide how one will face death is an act of freedom.\n\nFaith deepens this sovereignty. Scripture calls death an enemy, but also declares it defeated: “The last enemy to be destroyed is death” (1 Cor. 15:26). For Christians, mortality is real but not final. This reorders life: if Christ is risen, then death has lost its sting. Sovereignty is not clinging to years but living in hope, building for eternity.\n\nBitcoin echoes this ethic. It refuses the fiat illusion that time preference can be ignored. It rewards patience, saving, and discipline. It anchors value across generations, beyond the reach of debasement. To store wealth in Bitcoin is to face mortality truthfully: you will not live forever, but your labor can bless your children and grandchildren in incorruptible form.\n\nSovereignty at the end of life thus becomes both personal and communal. Personally, it means choosing dignity, truth, and rest. Communally, it means leaving behind legacies—cathedrals of stone, code, or money—that give death the finger. Every act of kindness, every sovereign decision to build for others, mocks death’s supposed power. Death may end our breath, but it cannot erase what is rooted in Christ and in truth.\n\nTo face mortality in sovereignty is not resignation. It is rebellion. It is the refusal to let fiat illusions, profit-driven industries, or cultural denial dictate the terms of our goodbye. It is to say, with clarity and hope: death, you are an enemy, but you have already been defeated. And in that knowledge, we are free.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net",
  "sig": "89c3320fc0b7215c5e0f340b0cf189678b18b1bb618aa388871632d494676bb711542080f833def3f47bc8557d743ba9e123e552736809599072b8c7e32c3469",
  "_source": [
    "primal backup",
    "wss://nostr.bitcoiner.social"
  ]
}