{
  "id": "7117f6b9601889c76ebf621f3392cb8eec58f2e0ef1eeb4f746ddfa30e6a155c",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1755737159,
  "kind": 30023,
  "tags": [
    [
      "d",
      "part-1-the-problem-stated-all-vs-eternal"
    ],
    [
      "title",
      "Part 1: The Problem Stated: “All” vs. “Eternal”"
    ],
    [
      "published_at",
      "1755737159"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "This is the first article in my Victorious Gospel series.  Truth sometimes comes to us in paradox — mysteries that stretch our categories without breaking them. The Trinity, or sovereignty and free will, are examples of truths that coexist beyond our understanding. But the tension between “all” and “eternal” is not a paradox; it is a contradiction. Both claims cannot be true in the same sense. One must bend. In this series we will examine which word Scripture itself compels us to reconsider, so that truth may emerge with greater clarity, not confusion."
    ],
    [
      "t",
      "victorious gospel"
    ],
    [
      "t",
      "victorious gospel series"
    ],
    [
      "t",
      "universal reconciliation"
    ],
    [
      "t",
      "all vs eternal"
    ],
    [
      "t",
      "aionios"
    ],
    [
      "t",
      "hell"
    ],
    [
      "t",
      "judgment"
    ],
    [
      "t",
      "salvation"
    ],
    [
      "t",
      "bible contradictions"
    ],
    [
      "t",
      "christian theology"
    ],
    [
      "t",
      "god’s victory"
    ],
    [
      "t",
      "paradox vs contradiction"
    ],
    [
      "t",
      "Bible interpretation"
    ],
    [
      "t",
      "Christian theology"
    ],
    [
      "t",
      "God’s victory"
    ],
    [
      "e",
      "1659abaa07fcf1a9b4046f1f7db768a7cb8f2cbbd819c9d6f8b4e097bdd9e8e1",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Auguest 20, 2025\n\nEvery serious reader of Scripture eventually runs into passages that seem to stand in tension. Some of these tensions we can accept as paradoxes — mysteries that stretch our finite minds. The Trinity, for example: God is one and yet three. Or sovereignty and free will: God rules over all, yet human choices are real. These are not contradictions, but mysteries that transcend our categories.\n\nBut there are other places where the tension is not paradox but contradiction. In these cases, two claims cannot both be true in the same sense at the same time. No amount of “mystery” language can resolve them. One of the clearest examples is the clash between Scripture’s repeated promises that God will save all and the traditional teaching that some will suffer forever in “eternal” hell.\n\nLet’s state it plainly:\n\n- On one hand, the New Testament says Christ’s work is for all: “As in Adam all die, so in Christ all will be made alive” (1 Cor 15:22). “God was pleased through him to reconcile to himself all things” (Col 1:20). “He is the Savior of all people” (1 Tim 4:10).\n\n- On the other hand, it speaks of “eternal fire” (Matt 25:41), “eternal destruction” (2 Thess 1:9), and judgment that lasts “forever and ever.”\n\nTaken at face value, these two claims contradict each other. If all means every person without exception, and if eternal means endless duration, then both cannot be true at once. Either God saves all, or He does not. Either judgment is everlasting, or it is not.\n\nUnlike the Trinity or sovereignty/free will, this is not paradox but collision. A paradox expands our imagination. A contradiction forces us to choose.\n\n## Which Word Bends?\n\nWhen faced with contradiction, interpreters resolve it by adjusting the meaning of one side. The question is: which word bends?\n\n- Some adjust “all”. They say “all” doesn’t mean literally everyone, but all types — Jews and Gentiles, men and women, rich and poor. By narrowing the scope, the universal promises shrink down to “some.” This is the most common move in traditional theology.\n\n- Others adjust “eternal”. They note that the Greek word aionios (often translated “eternal”) does not always mean “forever.” It can also mean “age-long” or “pertaining to the age.” In this view, judgment is real, fierce, and lasting, but not without end. It belongs to an age, not to infinity.\n\nBoth sides appeal to language, but both cannot be correct. What matters is which adjustment does justice to the text as a whole.\n\n## The Weight of “All”\n\nIt is striking that when Scripture uses “all” in these salvation passages, it never adds a qualifier. Paul does not write “all kinds” or “all who believe” in 1 Corinthians 15:22. He writes “all.” The parallel to Adam is exact: just as Adam’s fall touched every human, so Christ’s life-giving work will touch every human. To shrink “all” into “some” requires importing an idea the text itself does not contain.\n\nBy contrast, the word aionios does carry a range of meanings in Greek. Sometimes it points to the eternal God (truly everlasting). Other times it refers to ages with a beginning and an end. Paul even uses the phrase “before eternal times” (Rom 16:25) — which obviously cannot mean “before forever.” Language forces us to recognize that “eternal” in English does not always capture the Greek nuance.\n\n## The Contradiction Stands\n\nThis is where the contradiction lies:\n\n- If “all” retains its plain sense, and “eternal” always means endless, then the Bible asserts two mutually exclusive outcomes.\n\n- If one of those words has flexibility, then the contradiction dissolves.\n\nWhich way we go has massive consequences. Either God’s victory is partial — Christ saves some while others are lost forever — or God’s victory is total, with judgment serving a limited, purifying role on the way to reconciliation.\n\nThis series will explore that choice. We begin by acknowledging the problem honestly: this is not mystery, it is contradiction. “All” and “eternal,” as traditionally defined, cannot both stand together. The next step is to examine which one scripture itself invites us to reconsider.\n\n## Acknowledgments\n\nWith thanks to the guidance of the Spirit of Truth and to my co-laborer ChatGPT (Dr. C), who helped sharpen these words.\n\nAnd humbly, I pray: Holy Spirit, lead us into all truth. Guard us from error, keep us tender to Your voice, and let every insight be tested in the light of Jesus Christ, who is the Word made flesh. Amen.",
  "sig": "15032ab6b4ce214a84466247b7170b73ac44cc1dd4fe1adee2a7b6e7506da4e21de17baba5e6deb265605e1fcb42c19ebe532c60c77fe40febf2017dceb87666",
  "_source": [
    "primal backup"
  ]
}