{
  "id": "72ba73f10c5d35981ce5ab52e12611c0b89fca312b28e2eb641ee3a5cbcb61cb",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1757801743,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-2-sept-14-2025-new-lakota-council-meeting--100th-anniversary-the-bitcoin-chronicles"
    ],
    [
      "title",
      "Free Article 2 (Sept. 14, 2025): New Lakota Council Meeting – 100th Anniversary: The Bitcoin Chronicles"
    ],
    [
      "published_at",
      "1757801743"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "A fictional retelling of a Lakota council meeting held in the Cathedral on Mars, one hundred years after the tribe’s adoption of Bitcoin. Here, sovereignty, tradition, and interplanetary destiny converge in a single location that will one day become humanity’s gateway to the stars."
    ],
    [
      "display_date",
      "2025-09-14"
    ],
    [
      "t",
      "bitcoin chronicles"
    ],
    [
      "t",
      "lakota"
    ],
    [
      "t",
      "mars"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "tradition"
    ],
    [
      "t",
      "cathedral on mars"
    ],
    [
      "t",
      "future"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "71e8266e24702c3a888624de7db9cc868ce3dfd19d5bb624804e2203d93aae3b",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Sept. 14, 2025\n\nIt was the hundredth anniversary of the day the Lakota Nation formally adopted Bitcoin. The great council fire burned brightly, though this fire was unlike any on Earth. Encased within the protective dome of the Cathedral on Mars, its flames licked upward toward a sky of engineered glass that refracted the red dust storms outside. The dome itself had been designed with both Martian science and Lakota artistry—etched with constellations that no longer matched Earth’s night sky, but carried memories of it.\n\nThe Cathedral was the heart of New Lakota, the sovereign tribal settlement founded during the early waves of Mars colonization. What had begun as a single council chamber and fire pit had, over the past century, expanded into a sprawling structure of stone, crystal, and alloy. It was not a cathedral in the religious sense alone, though rituals certainly unfolded here; it was a living space of sovereignty, remembrance, and renewal. And though the Lakota had built it, they had always opened its doors to all sovereign settlements on Mars.\n\nToday, its floor was crowded with chiefs, elders, youth, and guests from allied colonies. The smell of burning sage mingled with the sterile tang of recycled air, a reminder that they lived on a world both ancient and new. Unlike past councils, where disputes had once centered on land, resources, or outside pressure, this gathering carried a tone of thanksgiving.\n\n## A Century Remembered\n\nA century earlier, the Lakota had faced relentless challenges on Earth: land stripped away through broken treaties, economic exploitation, and political marginalization. The decision to adopt Bitcoin had not been a mere financial strategy. It was a spiritual declaration that sovereignty could not be granted by governments or revoked by fiat policy—it had to be reclaimed at the deepest level. For one hundred years, their wealth had not been diluted by central banks, and no outside authority had dictated the terms of their survival.\n\nThat conviction had carried them to Mars. While governments and corporations debated jurisdiction and property rights, the Lakota had purchased their passage with pooled Bitcoin. They carried not debt contracts but private keys, not colonial charters but ancestral prayers. The first Lakota spacecraft bore symbols of the buffalo and the eagle, painted alongside the orange ₿.\n\nThe Cathedral on Mars had risen from that vision: a place to gather, to decide, and to remember. Now, on the centennial of Bitcoin adoption, the Lakota and their allies came to renew their vows.\n\n## Voices of the Elders\n\nAn elder rose, his voice carrying the weight of two worlds. His face was lined not only with age but with the memory of Earth, for he had been born before the migration. “We carried with us the stories of Standing Rock,” he said, “of protests that were ignored, of treaties broken. We swore never again to let others write our destiny. Bitcoin was the covenant we made with ourselves—unbreakable, incorruptible. And here we are, a hundred years later, sovereign under a different sun.”\n\nThe assembly answered with a low hum—a sound rooted in Earth’s ceremonies, now resonant in Martian domes. The firelight flickered against the elder’s robes, adorned with beadwork patterns older than any settlement on Mars.\n\n## A Young Voice\n\nThen a young woman rose to speak. She was a coder, trained in the protocols that connected Martian settlements, but her words were woven with the wisdom of her ancestors. She reminded the council that Bitcoin had not erased hardship but had given the Lakota freedom to endure it on their own terms. She gestured toward the fire, its flames reflected in the crystalline dome. “As this fire cannot be controlled by one hand,” she said, “so too Bitcoin cannot be controlled by one power.”\n\nHer words drew murmurs of agreement. Some tapped their drums; others pressed hands against their hardware wallets, as if touching both tradition and technology at once.\n\n## The Cathedral as Symbol\n\nThe Cathedral itself was testimony to their resilience. At its center was the original council fire pit, preserved exactly as it had been in the early days. Around it rose newer additions: galleries carved with Lakota constellations, hydroponic gardens where sacred plants grew, and digital archives etched into stone with cryptographic hashes. The Cathedral was both a temple and a node—a physical reminder that sovereignty required both roots and networks.\n\nVisitors from allied sovereign colonies—some Martian-born, some from Earth—spoke of how the Cathedral had become more than a tribal site. It was the agreed-upon place where disputes were mediated, alliances celebrated, and memories recorded. It was sovereignty’s anchor, not just for the Lakota but for all who refused centralized rule.\n\n## Foreshadowing the Future\n\nAs the ceremony continued, projections danced above the dome, showing not Earth’s constellations but Mars’s red-streaked sky. Some images showed even further horizons: future colonies on Europa, Titan, and beyond. Elders spoke of dreams that their great-great-grandchildren might walk under alien suns yet still carry the flame of sovereignty.\n\nWhispers among the youth hinted at new discoveries—experiments in quantum entanglement that might one day allow travel not by rocket but by instant passage across the stars. If that was true, then the Cathedral itself, already a gathering place for sovereign settlements, could one day serve as a waypoint for humanity’s leap to the nearest star systems. What had begun as a council dome might become the gateway to interstellar freedom.\n\n## Renewal\n\nAs the meeting drew to a close, the elders, youth, and guests stood together around the fire. Songs were sung in Lakota, their rhythms echoing against the dome’s vast acoustics. Drums beat in harmony with the hum of machinery outside, where life-support systems kept the settlement alive. The fire burned steadily, reminding all that sovereignty endured across worlds.\n\nThe anniversary was more than remembrance—it was renewal. It was the promise that sovereignty, once reclaimed, could never again be surrendered. The Cathedral on Mars stood as proof: that a people could carry their identity across space, root it in new soil, and open it to others without losing its soul.\n\nAs the last hymn faded, the fire dimmed but did not die. Outside, Martian dust storms raged. Inside, the Cathedral blazed with a light that would one day guide humanity beyond the solar system.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net",
  "sig": "4cf6c1fa91e0c26b9d8c044490ada43cfdeb68f22442c1bf22dd88d3b3ec62969951b56a3fc3219561e726a0183bde0abe779f7ce52c1e0eae95c950acd52699",
  "_source": [
    "primal backup",
    "wss://nostr.bitcoiner.social"
  ]
}