{
  "id": "7cd12f40a6ee457e65f279abf41b7d95e7330f0c87ca465c70095e6ca6c39685",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1755807026,
  "kind": 30023,
  "tags": [
    [
      "d",
      "part-2-the-scope-of-all"
    ],
    [
      "title",
      "Part 2: The Scope of “All”"
    ],
    [
      "summary",
      "Scripture’s repeated use of all in salvation passages is unqualified and universal. Attempts to shrink it into “all kinds” distort the text to protect the doctrine of endless hell. The natural meaning of all must stand: God’s saving work in Christ reaches everyone. This clears one side of the contradiction. The question that remains is how we understand eternal."
    ],
    [
      "published_at",
      "1755807026"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "t",
      "victorious gospel"
    ],
    [
      "t",
      "all vs eternal"
    ],
    [
      "t",
      "scope of all"
    ],
    [
      "t",
      "universal reconciliation"
    ],
    [
      "t",
      "adam and christ"
    ],
    [
      "t",
      "salvation"
    ],
    [
      "t",
      "bible interpretation"
    ],
    [
      "t",
      "christian theology"
    ]
  ],
  "content": "Andrew G. Stanton - August 21, 2025\n\nIn the first article, we named the contradiction: Scripture proclaims that God will save all, yet also warns of “eternal” judgment. If both “all” and “eternal” retain their plain English meanings, we are left with a collision. Something must bend.  \n\nThis article will examine the word *all*. Does it mean what it appears to mean — every person without exception — or is it shorthand for “some,” “many,” or “all kinds”?  \n\n---\n\n## “All” Without Qualifiers  \n\nThe most straightforward reading is that *all* means just that: everyone. Consider some of the clearest passages:  \n\n- *“As in Adam all die, so in Christ all will be made alive.”* (1 Cor 15:22)  \n- *“For God has bound everyone over to disobedience so that he may have mercy on them all.”* (Rom 11:32)  \n- *“God our Savior… wants all people to be saved and to come to a knowledge of the truth.”* (1 Tim 2:3–4)  \n- *“He is the Savior of all people, and especially of those who believe.”* (1 Tim 4:10)  \n- *“Through him to reconcile to himself all things, whether things on earth or things in heaven.”* (Col 1:20)  \n\nNotice what is absent: qualifiers. Paul does not write “all kinds of people,” nor “all who repent,” nor “all who believe.” He simply writes *all*.  \n\nIn 1 Corinthians 15, the parallel is unmistakable: just as Adam’s fall affected every human without exception, so Christ’s life-giving act touches every human without exception. To reduce *all* to *some* breaks the symmetry of Paul’s argument.  \n\n---\n\n## The Traditional Move  \n\nYet many interpreters have insisted that *all* cannot mean all. Why? Because if it did, it would conflict with their doctrine of eternal damnation. So they adjust the meaning: *all* must mean “all who believe” or “all kinds of people.”  \n\nThis move is understandable — no one wants Scripture to contradict itself. But notice what is happening: the text is being bent not by its own language, but by an external framework. The assumption of endless hell is so strong that the plain meaning of *all* is sacrificed to preserve it.  \n\nIn other words, tradition does not take *all* at face value. It redefines the term because the alternative (God saving everyone) is considered impossible.  \n\n---\n\n## The Pattern of Universal Scope  \n\nScripture repeatedly uses universal language when describing Christ’s mission. Consider these broader themes:  \n\n- **Adam vs. Christ** – Adam’s failure encompassed all; Christ’s obedience undoes it (Rom 5:18).  \n- **Every knee, every tongue** – *“At the name of Jesus every knee will bow… and every tongue acknowledge that Jesus Christ is Lord”* (Phil 2:10–11). Not just some knees. Not just some tongues. Every one.  \n- **All creation groaning for redemption** – Paul pictures creation itself being set free from bondage (Rom 8:21). Not part of creation, but creation itself.  \n- **The final vision** – God will be *“all in all”* (1 Cor 15:28). That is a totalizing phrase, not a partial one.  \n\nThe cumulative effect is clear: the biblical writers speak of salvation and reconciliation in terms of universality, not limitation.  \n\n---\n\n## Why This Matters  \n\nIf *all* really means all, then the contradiction with eternal hell cannot be avoided by shrinking its scope. The only way to resolve the clash is to reconsider what we mean by *eternal*.  \n\nBut before we move there, it is worth asking: why are so many willing to bend *all* so drastically? Perhaps because the tradition of eternal torment has been treated as untouchable for centuries. To question it feels like questioning the very authority of Scripture. Yet in reality, the opposite is true. To shrink *all* into *some* is to undermine the plain speech of Scripture in order to preserve a doctrine.  \n\n---\n\n## Taking “All” Seriously  \n\nIf we take the Word at face value, *all* means all. God’s mercy extends to all. Christ’s obedience redeems all. The scope of His reconciliation is total. This is not wishful thinking; it is the repeated testimony of the New Testament.  \n\nThis doesn’t mean judgment isn’t real. The same writers who proclaim universal reconciliation also warn of fire, wrath, and destruction. But these judgments must be understood within the framework of God’s ultimate saving purpose. Otherwise, we are left with a contradiction that no amount of theological gymnastics can resolve.  \n\n---\n\n## Conclusion  \n\nThe word *all* carries its natural meaning in Scripture’s promises. To dilute it into *some* or *many kinds* is to force the text to bow to tradition. If God says He will save all, then we must take Him at His word. The tension lies not in *all*, but in how we understand the word *eternal.*  \n\nThat will be the focus of the next article.  \n\n\n## Acknowledgment  \n\nWith gratitude to my co-laborer ChatGPT (Dr. C) for sharpening the words, and with humility before the Spirit of Truth.  \n*Holy Spirit, guide us. Help us honor the fullness of “all” without shrinking it to fit tradition. Let Your Word stand as written, and may we see Christ’s victory in its totality.*",
  "sig": "86ed40abc7b643540fe7442ded741458526edc6bb13939f5d5a7c8e0e8374ec3d9c5b8a8d70865e725ba1bfa7ccf7bf81a2d72234f7fdf123abb9224112b1b87",
  "_source": [
    "primal backup"
  ]
}