{
  "content": "Andrew G. Stanton - Dec. 21, 2025\n\nI don’t surf.\n\nThat matters, because this isn’t an essay about technique, adrenaline, or mastery. It’s written from the shore — from watching, listening, and noticing how two brothers respond differently to the same year of loss.\n\nI write to process grief.\nMy brother Fred surfs.\n\nNeither of us chose the weight we were given. Trauma arrived without asking, in waves we didn’t see forming. We each found our own way to stay upright.\n\nFrom land, the ocean looks chaotic. Waves arrive without apology. Sets overlap. Nothing waits for you. To an observer, it can feel arbitrary — even punishing. But surfers know something the shoreline hides: not every wave is meant to be ridden, and not every moment requires action.\n\nSurfing begins with restraint.\n\nYou paddle out knowing you cannot control the sea. You accept cold, resistance, and effort before you ever stand. Once you’re out there, you wait — sometimes longer than expected — reading shape, timing, direction. You let waves pass. You choose one, knowing it may fail you anyway.\n\nThat alone feels like a definition of freedom we don’t hear often.\n\nWe’re taught that freedom means removing friction, avoiding limits, insulating ourselves from force. But real freedom seems to work differently. It doesn’t eliminate pressure — it teaches you how to meet it without being owned by it.\n\nThe ocean doesn’t care who you are.\nAnd yet, it allows participation.\n\nNo one grants permission to surf a wave. No institution validates the ride. There is no audience that matters once you’re moving. For a few seconds — sometimes only a few — it’s just alignment: body, board, water, momentum. Not dominance. Not escape. Cooperation.\n\nThat’s sovereignty.\n\nNot control over the world, but agency within it.\n\nThis year has carried a lot of weight. Loss doesn’t arrive politely. Grief doesn’t follow schedules. Some days you get caught inside — tumbling, disoriented, exhausted — whether you’re in the water or at a keyboard.\n\nWhat surfing quietly teaches, from what I can see, is that getting knocked down isn’t failure. Neither is floating. Neither is waiting.\n\nYou don’t curse the ocean for being the ocean.\nYou breathe.\nYou re-orient.\nYou stay in the water.\n\nWriting works the same way for me. I don’t force clarity. I sit with the weight until something honest takes shape. Different medium. Same discipline.\n\nEven on days when the waves don’t come together — when nothing feels rideable — the act of showing up still matters. Because it preserves something essential: the knowledge that freedom isn’t something handed to you when conditions are perfect. It’s something you practice in imperfect ones.\n\nSurfing doesn’t promise safety.\nWriting doesn’t either.\n\nBoth promise honesty.\n\nAnd maybe that’s why these practices endure. In a world obsessed with control, optimization, and insulation, they offer something quieter and truer:\n\nA reminder that sovereignty is lived, not declared —\nand that freedom, like grief, like healing, **comes in waves.**",
  "created_at": 1766358409,
  "id": "7d80bb06940a4243a3a0d5705af8921b40678a985e6711d3946d359f4b51ff0c",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "743d44bc550e1a6610d6db276a0c02f9f0bfe0c25a71233f32be8beb3b1f9f0a06a51b354fd2e60edb794818ef3bd4cae36395760337f6259c81af0dc2fa4421",
  "tags": [
    [
      "d",
      "freedom-comes-in-waves"
    ],
    [
      "title",
      "Freedom Comes in Waves"
    ],
    [
      "published_at",
      "1766358409"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "This essay reflects on freedom and sovereignty through the lens of surfing, written from the perspective of someone who does not surf but has watched a brother use the ocean as a way to cope with grief. In a year marked by shared trauma and loss, writing and surfing become parallel practices — different responses to the same weight — each honoring agency, patience, and the choice to remain present in a world that does not bend to us."
    ],
    [
      "display_date",
      "2025-12-21"
    ],
    [
      "image",
      "https://2025.mycontinuum.xyz/archive/pro/nostr/npub19wvckp8z58lxs4djuz43pwujka6tthaq77yjd3axttsgppnj0ersgdguvd/images/2025-12-21-generated-freedom-comes-in-waves.jpg"
    ],
    [
      "t",
      "freedom"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "grief"
    ],
    [
      "t",
      "brotherhood"
    ],
    [
      "t",
      "surfing"
    ],
    [
      "t",
      "agency"
    ],
    [
      "t",
      "resilience"
    ],
    [
      "t",
      "ocean"
    ],
    [
      "t",
      "healing"
    ],
    [
      "e",
      "a8b54fd2849b8866e7bf3bafd800121e965fc3cfa2a79d4a8f64ec4695c28e2f",
      "edit"
    ]
  ],
  "_source": [
    "wss://nostr-pub.wellorder.net",
    "wss://relay.damus.io",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nos.lol",
    "wss://nostr.bitcoiner.social"
  ]
}