{
  "id": "7dccfb91ca0b28f05b44b0297fad4a660ee8dcce93560c8d572b705d8cb768db",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1758579685,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-1-sept-19-2025-when-your-income-doesnt-count"
    ],
    [
      "title",
      "Free Article 1 (Sept. 19, 2025: When Your Income Doesn’t Count"
    ],
    [
      "published_at",
      "1758579685"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "Discusses how credit and lending systems dismiss nontraditional forms of income, punishing entrepreneurs and investors. Proposes a sovereign reputation system that values proof of reliability over tax form codes."
    ],
    [
      "display_date",
      "2025-09-19"
    ],
    [
      "t",
      "credi"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "reputation"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "d386f5bf2f5f34b32fec6c51432a243fbb96121ce931d22f97710d7e44563c1b",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Sept. 19, 2025\n\nImagine working hard for an entire year—trading, investing, managing assets, maybe even building something from scratch. At the end of the year, you have money in the bank, bills paid, and a track record of activity. But when you apply for credit, the system tells you: “You earned nothing.”\n\nThis is the absurdity of Schedule D income. Capital gains, even when realized, do not count the way W-2 wages or Schedule C earnings do. To lenders, it is as if the year never happened. The form you used to report determines whether you are “worthy” of credit—not the fact that you provided for yourself, not the fact that you honored obligations, not the fact that you survived.\n\nEntrepreneurs and investors know this pain well. Traditional banks and credit agencies reward predictability over initiative. A steady paycheck scores higher than volatile success. A safe corporate job ranks above a daring startup. The system is built not to recognize real productivity but to enforce conformity.\n\nThe bias is systemic. Someone who earns $80,000 through W-2 wages is welcomed with open arms by creditors, even if they spend recklessly and live paycheck to paycheck. Someone who makes the same amount through investments or self-employment may be denied, even if they are disciplined savers. It is not financial health that matters to the system—it is whether the income fits its narrow mold.\n\nThis bias has consequences. It punishes risk-takers. It excludes innovators. It forces people to channel activity through categories that bureaucracies understand. And it makes freedom more expensive by raising the cost of being independent.\n\nConsider the countless freelancers who cannot qualify for apartments because their income “does not count.” Or the investor who is told their Schedule D gains are irrelevant. These are not marginal cases—they are millions of people whose lives are distorted by the blindness of the system.\n\nWhat would a sovereign alternative look like? Instead of opaque credit scores, we could use verifiable proofs of behavior. Timely rent payments recorded on-chain. Mortgage receipts encrypted but selectively shareable. A record of fulfilled contracts, completed services, and satisfied clients. These are the true signals of reliability—not which IRS schedule line you filled out.\n\nThis is not fantasy. The tools exist. Bitcoin offers final settlement without intermediaries. Nostr enables communication without platforms. Continuum proposes identity without walled gardens. The next step is reputation without gatekeepers. Imagine a world where you could prove reliability directly, not through a scorecard maintained by Equifax or a loan officer’s checklist.\n\nSovereignty does not mean everyone qualifies for everything. Risk remains real. But risk should be measured by truth, not by bureaucracy. A person who has met obligations faithfully should not be excluded because of the line number on their tax form. Proof should matter more than paperwork.\n\nThe problem is not that the system cannot see. The problem is that it refuses to look. Sovereignty does not ask for permission to exist. It builds a parallel ledger where your worth is measured by proof, not paperwork. When the system says your income doesn’t count, sovereignty answers: “It counts to me, and to those who trust me.”\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net",
  "sig": "f7ef26acd78f7a7c264987abe2278eaca233d163ccdfc5967483beee7d5ebbd03b36c0f29bbf695dc7e74b8b2c3e22582a67cf25e3bcf3bc5c2e58645fbedffe",
  "_source": [
    "primal backup",
    "wss://nostr.bitcoiner.social"
  ]
}