{
  "id": "808d803677ed89d25556dce966a96f013594c6aa20d0140886f4439030bf2bf2",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1758524218,
  "kind": 30023,
  "tags": [
    [
      "d",
      "why-i-left-web3-for-proof-of-work---part-2:-the-breaking-point"
    ],
    [
      "title",
      "Why I left Web3 For Proof of Work - Part 2: The Breaking Point"
    ],
    [
      "published_at",
      "1758524218"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "I didn’t walk away from Web3 in a single moment — it was a slow realization that good intentions weren’t enough.When projects relied on fragile tokens, fiat subsidies, or endless talk, I began to question the structure itself.I still respect the people. I still show up sometimes. But my break was from the hype, not the humans.And in that quiet break, I found something stronger: Bitcoin. Work. Truth."
    ],
    [
      "display_date",
      "2025-05-18"
    ],
    [
      "t",
      "Bitcoin"
    ],
    [
      "t",
      "ProofOfWork"
    ],
    [
      "t",
      "Web3Exit"
    ],
    [
      "t",
      "WhyBitcoin"
    ],
    [
      "t",
      "BitcoinerJourney"
    ],
    [
      "t",
      "BuildWithConviction"
    ],
    [
      "t",
      "LongForm"
    ],
    [
      "t",
      "FaithAndFinance"
    ],
    [
      "t",
      "PoWNotPoS"
    ],
    [
      "t",
      "Startups"
    ],
    [
      "t",
      "NostrWriting"
    ],
    [
      "t",
      "SovereignTech"
    ],
    [
      "t",
      "BitcoinNotCrypto"
    ],
    [
      "t",
      "StillBuilding"
    ],
    [
      "t",
      "ConvictionOverCommunity"
    ],
    [
      "e",
      "bbbb8f711f3888731ec1e577b57e86977a650b03b5a3b45274e00d916b373263",
      "edit"
    ]
  ],
  "content": "🧱 Why I Left Web3 for Proof of Work – Part 2: The Breaking Point\n\nIt wasn’t a moment. It was a slow-motion unraveling.\n\nBy 2024, I was deeply involved in a Web3 project focused on rewarding eco-conscious actions using a token system called “Proof of Environment.” I helped run a related Facebook group aimed at building community and encouraging engagement — especially among refugees and people living on the margins.\n\nI believed in it. I have a lot of respect for the project’s founder. His heart is in the right place.\n\nBut reality set in: the token wasn’t trading.\nPeople were earning rewards that had no liquidity.\n\nSo I tried to bridge the gap. I personally subsidized the effort — offering USD to keep people engaged and compensated.\n\nEventually, I had to stop.\n\nNot because I lost faith in the mission… but because I realized I was compensating for a structural flaw. I was using fiat to prop up what was supposed to be an alternative to fiat.\n\nThat realization cracked something open. And it wasn’t just about that project.\n\nBy early 2025, I started re-examining the other Web3 spaces I was part of — including a local crypto-faith collective and a civic blockchain group I’d been attending.\n\nBefore I say more - *I want to be clear:*\n\n- I respect the people involved in these communities.\n- I believe their intentions are sincere, and their efforts often come from a genuine desire to help.\n- The speakers were engaging and thought-provoking.\n- This isn’t a judgment of hearts — it’s a reflection on structure, incentives, and what actually works.\n\nOne local Web3 community I attended regularly was especially revealing. It was connected to a publishing platform that promised a new way to engage content and community. But in practice, the tech was clunky, and the product was difficult to use — even basic edits to content required small fees in a token that few people understood. One of the DAOs I participated in burned through tens of thousands — mostly on architecture plans and design proposals.\n\nWeekly meetings had free lunches and spiritual talks… but the people experiencing homelessness, who we supposedly served? Often absent — or tokenized for optics.\n\nAt one point, I proposed a practical idea to support a local housing initiative. The vision was for residents to grow some of their own food — creating both sustainability and job training opportunities.\n\nThe response?\n\n“Let’s do this later.”\n\nIt was polite. But it meant no.\n\nOver time, I felt less like a contributor and more like a prop — quietly tolerated, not truly included.\n\nMeanwhile, others held titles, got paid (quietly, maybe — but it was hard to tell how), and kept the stage.\n\nThere was always funding for visibility. Rarely funding for outcomes.\n\nThe problems people actually faced — hunger, housing, dignity — don’t care about abstractions.\n\nAnd neither does Bitcoin.\n\nI didn’t leave all at once. I still showed up in March, April, and May — out of habit, curiosity, and maybe hope.\n\nThe speakers were thoughtful. In March, someone taught on mindfulness and the “five dimensions of time.” It was peaceful. But to me, it felt like another New Age sidetrack — far from the urgent needs on the ground.\n\nIn April, one speaker — a former military interrogator turned AI educator — spoke on an AI “OS” for schools. Another shared how they helped build local currencies in Kenyan villages.\n\nIn May, someone presented a trauma-informed housing model for youth with mental illness — one of the few ideas that felt truly grounded.\n\nThese were all great ideas — thoughtful, human, often moving.\n\nMy only thought was: they might have been better served by starting with Bitcoin — not as an add-on, but as a foundation. Especially the last two.\n\nAnd again — I believe many of the people involved were sincerely trying to make a difference.\n\nBut something had shifted in me.\n\nI couldn’t stop asking: Who actually benefits from this tech?\n\nDoes it work — or is it just another talk wrapped in hope?\n\nWhy does impact often need a token?\n\nNot all the speakers revolved around Web3 or tokens — but many did.\n\nAnd quietly, a deeper question emerged: Couldn’t we just do all of this… with Bitcoin?\n\nWithout a new platform. Without a fragile token.\n\nJust real tools. Real money. Real proof of work.\n\nThe breaking point wasn’t dramatic. It was subtle, quiet — but final.\n\n✍️ A Personal Note\n\nEven after all this, I still attend some of these events. I still show up — not because I’ve “come back,” but because I care.\n\nBecause I respect the people.\n\nBecause I believe conviction doesn’t require separation — it just requires clarity. I’m not circling back.\n\nI’m walking forward — with eyes open.\n\nAnd sometimes that means sitting in the same room with people I no longer fully agree with… and still learning something.\n\nMy break wasn’t from the people.\n\nIt was from the hype.\n\nFrom the structure, not the souls.\n\nAnd I still believe we can build better — if we start with truth.\n\n⚡ If this resonates, zap me some sats — or just share it forward.\n\n🤖 Drafted with the help of ChatGPT, who’s helped me find clarity across tech, theology, and everything in between.",
  "sig": "57a62c400732a3403aeb82c52d9348f4b3d86497cf8daf0240415ab1ead5f4b4d47788f7fea5b7c1f1d50811cbc995feb8f54a07b1c88741842f0f6f836145f2",
  "_source": [
    "primal backup",
    "wss://nostr.bitcoiner.social"
  ]
}