{
  "content": "Andrew G. Stanton - Sept. 12, 2025\n\n## The Promise\n\nWhen I joined World Financial Group (WFG) at the end of 2023, I heard the familiar pitch: *“Be your own boss. Build passive income. Achieve financial freedom.”*  \n\nThe actual products — in this case, insurance and investment vehicles — were almost secondary. The real product was **the dream.**  \n\nWeb3 sells the same thing. Instead of insurance contracts, the pitch is tokens, NFTs, or “decentralized finance.” Instead of uplines and downlines, you get Discord servers and crypto Twitter influencers. But the dream is the same: get in early, recruit others, and secure life-changing wealth.  \n\n---\n\n## The Structure\n\nOnce you look past the hype, the similarities are obvious.  \n\n- **Recruitment > product.**  \n  In MLMs, most income comes from signing up new recruits rather than selling products. In Web3, most “value” comes from onboarding new token buyers rather than real-world utility.  \n\n- **Complexity as camouflage.**  \n  MLMs bury the truth in layered compensation plans. Web3 cloaks it in jargon — staking, yield farming, liquidity pools. The effect is the same: confusion protects insiders.  \n\n- **Top-heavy payouts.**  \n  In both systems, the top 1–2% capture almost all the rewards. A few uplines in MLM make significant money. A handful of early token insiders in Web3 cash out life-changing gains. Everyone else fights over scraps.  \n\n---\n\n## The Culture\n\nBoth rely on culture to paper over the cracks.  \n\n- **Motivational hype.**  \n  At WFG, we were herded into seminars full of cheering, music, and testimonies from uplines living the “dream.”  \n\n- **Lifestyle flexing.**  \n  My upline’s brother flaunted success on Instagram — cars, vacations, motivational quotes. What he rarely mentioned: he had run a profitable car-sharing business before WFG. The lifestyle wasn’t built by the MLM, but the MLM gladly borrowed the image.  \n\n- **Crypto mantras.**  \n  Web3 has its own version: conferences with neon stages, Twitter feeds filled with memes, and the mantra “HODL” as a moral virtue. If you question the model, you’re told you “just don’t get it.”  \n\nBoth environments weaponize positivity. Doubt is weakness. Failure is personal, never structural. That keeps people loyal long after the math should have driven them away.  \n\n---\n\n## The Lesson\n\nStrip away the hype, and the outcomes are predictable.  \n\n- In MLMs, over 90% of participants make little or nothing.  \n- In Web3, the vast majority of tokens collapse, leaving retail buyers holding the bag.  \n\nThe pattern is identical: a few winners, a vast majority of losers, and a culture that blames the losers for not believing hard enough.  \n\n---\n\n## The Contrast: Bitcoin\n\nThis is where Bitcoin stands apart.  \n\n- No uplines.  \n- No central recruiter.  \n- No inflationary token model.  \n- Just transparent rules, fixed supply, and open access.  \n\nBitcoin doesn’t promise freedom someday. It *embodies* sovereignty now. No motivational rallies required. No lifestyle flexes needed. Just a protocol of property rights, secured by proof-of-work, open to all.  \n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net",
  "created_at": 1763254462,
  "id": "9cb00445539ac405182003d1379ca82846df0fd15d437fd8b816ac2b3a63e045",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "1e42800a7a8d91ac6f7d2657ae7035b55406d1405a5c6ac21758ad9beccfce2d513e9abdacd3b2383a09db2d7c5ce417623d0cf6564b8b839f376932cc3e8a65",
  "tags": [
    [
      "d",
      "free-article-1-sept-12-2025-mlm-and-web3-two-sides-of-the-same-pyramid"
    ],
    [
      "title",
      "Free Article 1 (Sept. 12, 2025): MLM and Web3: Two Sides of the Same Pyramid"
    ],
    [
      "published_at",
      "1763254462"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "Both multi-level marketing (MLM) and Web3 projects sell the same dream: financial freedom, lifestyle independence, and passive income. My short stint inside World Financial Group in 2023–2024 helped me recognize the same structural flaws now playing out across Web3. The names and technology change. The math doesn’t."
    ],
    [
      "display_date",
      "2025-09-12"
    ],
    [
      "t",
      "mlm"
    ],
    [
      "t",
      "web3"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "recruitment models"
    ],
    [
      "t",
      "continuum"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "2da9e64a1d2c8efe34dec5759044cba264012471229b87225b48070cccdc40a3",
      "edit"
    ]
  ],
  "_source": [
    "wss://nostr.mom",
    "wss://nos.lol",
    "wss://relay.snort.social",
    "wss://relay.damus.io"
  ]
}