{
  "id": "abf7a742fed23064a66741bca1f6f0523a8084ea601e83cc550106d1a2fccaf3",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1747689526,
  "kind": 30023,
  "tags": [
    [
      "title",
      "Why I Left Web3 for Proof of Work – Part 5: Building Again"
    ],
    [
      "summary",
      ""
    ],
    [
      "image",
      "https://blossom.primal.net/ec94145d068fc7877786a5a78c6bcb20c0864c011ad6265fd7b6597509696b9f.png"
    ],
    [
      "d",
      "why-i-left-web3-for-proof-of-work-–-part-5:-building-again"
    ],
    [
      "t",
      "Bitcoin"
    ],
    [
      "t",
      "ProofOfWork"
    ],
    [
      "t",
      "Web3Exit"
    ],
    [
      "t",
      "WhyBitcoin"
    ],
    [
      "t",
      "BitcoinerJourney"
    ],
    [
      "t",
      "BuildWithConviction"
    ],
    [
      "t",
      "LongForm"
    ],
    [
      "t",
      "FaithAndFinance"
    ],
    [
      "t",
      "PoWNotPoS"
    ],
    [
      "t",
      "Startups"
    ],
    [
      "t",
      "NostrWriting"
    ],
    [
      "t",
      "SovereignTech"
    ],
    [
      "t",
      "BitcoinNotCrypto"
    ],
    [
      "t",
      "StillBuilding"
    ],
    [
      "t",
      "ConvictionOverCommunity"
    ],
    [
      "client",
      "Primal"
    ],
    [
      "published_at",
      "1747689526"
    ]
  ],
  "content": "After the pruning came clarity.\\\nAnd after the clarity came a quiet but relentless question:\\\n**What now?**\n\nIf I wasn’t going back to Web3, if I wasn’t going to pretend anymore — not in faith, not in finance — then I needed to start *building again*. But this time, with different materials. Different rhythms. A different spirit.\n\n### Starting Over on Solid Ground\n\nI’d spent years exploring tokens, networks, and well-intentioned communities. But most of it, I see now, was sand. It moved with the tides. The incentives shifted. The values bent. And when the storms came — personal, financial, spiritual — much of what I’d been part of collapsed or exposed its shallowness.\n\nSo I returned to the beginning: **What can’t be faked?**\n\nThat’s where Bitcoin came in — not just as an asset, but as a foundation.\\\nIt taught me cost. Time. Truth. It doesn’t market itself. It just *is*.\\\nA system that punishes shortcuts, rewards discipline, and invites peace.\n\nAnd the more I leaned in, the more I realized:\\\nThis isn’t just money. This is philosophy. This is soil.\n\n### Pruned to Plant Again\n\nI used to be a buy-and-hold investor. I still carry those instincts. But in 2020–21, I discovered trading — and with it, a new kind of discipline. Not gambling. Not speculation. *Stewardship under pressure*. Real-time decision-making with skin in the game.\n\nMy grandfather, who passed in the late '90s, probably would’ve looked a little dimly on trading. He lived off his dividends. Stocks he held for decades. He wasn’t chasing. He was *rooting*. But he would’ve respected the discipline — the clarity — when done right.\n\nHe also saw things I didn’t. He once told me I wasn’t raised properly. It hurt at the time, but now I understand. He saw the drift — not just in me, but in the culture. He understood that frugality means nothing if it’s not paired with truth.\n\nI think he would’ve respected what I’m doing now — even if he wouldn't have fully understand it.\n\n### What I’m Building Now\n\n* **StartNation** – A Bitcoin-aligned equity accelerator. Proof-based. No tokens. No hype.\n\n* **Golden Gate Group Investments** – Real estate with a vision to integrate BTC in payments and ownership. Still early. Still real.\n\n* **Blue Planet Ventures** – Equities trading with daily proof-of-work and sats-based performance tracking.\n\n* **A garden** – Yes, literal food. Soil and seed. Hypdropnics. Bitcoin taught me patience; gardening reinforces it.\n\nI’m not building a brand. I’m building a life. And I’m doing it in public — not to be seen, but to help others see. That it’s possible to step off the hype rails and still *thrive*.\n\n### Bitcoin: The Turning Point\n\nIt wasn’t until last fall that Bitcoin truly became central for me.\\\nNot just part of a portfolio — the *lens* through which I see capital, time, and truth.\n\nI don’t see it as speculative anymore. I see it as inevitable. In 20–30 years, I believe Bitcoin will be the de facto reserve currency — even if not in name. Those who hold it will steward wealth not because they played the game, but because they *opted out of it* early.\n\nI’m stacking not to escape — but to prepare. Not to prove I'm right — but to live rightly.\n\n### Legacy Without a Platform\n\nI don’t have children.\\\nBut I do have nieces. Nephews. Brothers. Sisters. Cousins. In-Laws.\n\nAnd I know they’re watching — even if they don’t say it.\\\nI want to show them that you can live with truth, walk by faith, work with your hands — and still thrive.\n\nI’m not stacking for applause. I’m stacking for legacy.\\\nI’m building not just for the next quarter — but for the next generation.\n\nAnd if someone, years from now, asks why I chose this path, I want to say:\n\n*Because it was real.*\\\n*Because it was proof.*\\\n*Because it was built to last.*\n\n***\n\n**⚡ If this series has encouraged or challenged you, zap a few sats/bitcoin. It keeps me building.**\n\n✍️ Catch up on the full series here:\\\n\\\nPart 1: The Drift -> <https://primal.net/andrewgstanton/why-i-left-web3-for-proof-of-work-%E2%80%93-part-1%3A-the-drift>\\\nPart 2: The Breaking Point -> <https://primal.net/andrewgstanton/why-i-left-web3-for-proof-of-work---part-2%3A-the-breaking-point>\\\nPart 3: The Return -> <https://primal.net/andrewgstanton/why-i-left-web3-for-proof-of-work-%E2%80%93-part-3%3A-the-return>\\\nPart 4: Proof Of Work as Philosophy -> <https://primal.net/andrewgstanton/why-i-left-web3-for-proof-of-work-%E2%80%93-part-4%3A-proof-of-work-as-philosophy>\\\nPart 5: Building Again (**what you are reading now\\...**)\n\nWritten with help from ChatGPT (GPT-4), edited and posted by me.\n",
  "sig": "dcd8e347db784780819739e80d4f69457d597e8a98cf58f91d0d8bca130efad618bf1c0375039223a315dc0802c6e0ec1aa5d22af9fbcb894c0fdb40aaee2b12",
  "_source": [
    "primal backup"
  ]
}