{
  "id": "ba77d2875f83afbaa1a84504d00f702d4f171d4328833647b017498489d81c36",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1761865627,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-2-oct-31-2025-the-legalized-lie"
    ],
    [
      "title",
      "Free Article 2 (Oct. 31, 2025): The Legalized Lie"
    ],
    [
      "published_at",
      "1761865627"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "Fractional-reserve banking works only because people agree not to look too closely. It is the most refined illusion of the modern age — faith disguised as finance."
    ],
    [
      "display_date",
      "2025-10-31"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "soundmoney"
    ],
    [
      "t",
      "continuum"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "fractionalreserve"
    ],
    [
      "t",
      "truth"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "d35931a9e3ebe479db7c56c0ec63d32d8ec473bd5a02185ed0480d7d5115501e",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Oct. 31, 2025\n\nFractional-reserve banking promises everyone the same dollar at the same time, even though that dollar exists many times over on different ledgers. It functions because the lie is *coordinated*: as long as withdrawals are modest and confidence holds, the illusion appears real.\n\nEconomists call it liquidity creation; moral language would call it what it is — **legalized deceit**. A bank lends what it doesn’t have, a borrower spends what was never saved, and a central bank stands ready to conjure more if belief falters. The entire structure depends on the suspension of disbelief.\n\nBitcoin breaks that spell. It replaces *trust me* with *verify me.* It doesn’t outlaw credit or risk; it just refuses to counterfeit reality to sustain them.\n\nThe world will keep pretending a while longer. But once you’ve seen the trick, you can’t unsee it.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net\n\n## Copyright\n\n© 2025 Continuum — All rights reserved.",
  "sig": "d883c424430b2e42596bd961c8fc4193f52702cee854b77b6b534aa84ba7d8338713f9d37f5b3c3e7bb59ea764467e16a0d9a92d8220c868c9f42d079cc407f5",
  "_source": [
    "wss://nos.lol",
    "primal backup",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nostr.bitcoiner.social",
    "wss://relay.damus.io"
  ]
}