{
  "content": "Andrew G. Stanton - Sept. 15, 2025\n\nEvery choice we make is a seed. Some sprout quickly, others take years to show fruit. Some grow into weeds that choke life, others into trees that give shade for generations. The seeds we plant today will determine whether sovereignty or slavery grows tomorrow.  \n\n### Seeds of Freedom vs. Seeds of Slavery  \n\nWhen we choose to save in Bitcoin instead of fiat, we plant seeds of freedom. We are teaching ourselves and our children that money can exist outside the control of governments and banks.  \n\nWhen we choose to homeschool our children or at least to supplement their education with lessons of truth, integrity, and critical thought, we plant seeds of resilience. We demonstrate that learning cannot be outsourced entirely to the state.  \n\nWhen we choose to support local farmers or grow our own food, we plant seeds of independence that grow into healthier bodies and stronger communities.  \n\nBut we also plant seeds of slavery. Every swipe of a credit card with no thought of repayment is a seed of debt. Every hour spent scrolling feeds curated by algorithms is a seed of distraction. Every blind trust in government mandates is a seed of dependence. The harvest may not appear overnight, but it is inevitable.  \n\n### Generational Impact  \n\nSeeds do not grow in isolation; they grow into forests that generations inherit. The decisions we make today will shape the lives of our children and grandchildren. A father who refuses to save or prepare may leave his family vulnerable. A mother who plants seeds of truth and integrity leaves her descendants a legacy of strength.  \n\nThe Bible says, “A good man leaves an inheritance to his children’s children.” That inheritance is not only financial; it is cultural, spiritual, and practical. It is the fruit of countless seeds planted with intention.  \n\n### Stories of Planting and Harvest  \n\nConsider the Amish. Their refusal to adopt many modern conveniences may seem strange, but the harvest is clear: strong communities, skilled trades, and a deep sense of belonging. They planted seeds of intentional separation, and the result is sovereignty from many of the cultural crises plaguing the modern world.  \n\nContrast this with societies that planted seeds of indulgence and apathy. The Roman Empire’s obsession with spectacle and decadence produced a harvest of collapse. Our own Western world, addicted to consumption and debt, may reap a similar harvest unless we change the seeds we sow.  \n\n### Practical Seeds to Plant Today  \n\n- Teach children about money by showing them how Bitcoin works.  \n- Plant literal seeds in gardens to reduce dependency on industrial agriculture.  \n- Choose truth over comfort by reading deeply instead of scrolling endlessly.  \n- Build local communities rather than relying solely on digital ones.  \n\n### Conclusion  \n\nSovereignty is not secured in one grand decision but in countless daily sowings. To plant with intention is to recognize that the soil of our lives is precious. If we plant wisely today, we will reap freedom tomorrow.  \n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net",
  "created_at": 1765591187,
  "id": "bead078f6ef9129e811f47727e038edcf49800e0383750522012e06b26870fad",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "1091792c80d4db7a34d325aa2c8308e516d528a08d376cb39991fca39d4e56f7dcc861f4d21c5fb85cae49e7af2ab556d851a84b749755745249f76e38d0b340",
  "tags": [
    [
      "d",
      "free-article-1-sept-15-2025-the-seeds-we-plant-today"
    ],
    [
      "title",
      "Free Article 1 (Sept. 15, 2025): The Seeds We Plant Today"
    ],
    [
      "published_at",
      "1765591187"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "This reflection considers how small, daily acts — where we store our wealth, what platforms we use, how we raise our families — become seeds of future sovereignty or dependence. It calls for intentional planting."
    ],
    [
      "display_date",
      "2025-09-15"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "choices"
    ],
    [
      "t",
      "planting"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "future"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "62ec4c6347453627af04c5ec0eddc330b34fa7dcb1a379c9b0d97d178e5118b7",
      "edit"
    ]
  ],
  "_source": [
    "wss://relay.snort.social",
    "wss://nostr.mom",
    "wss://nostr.bitcoiner.social",
    "wss://relay.damus.io",
    "wss://nos.lol"
  ]
}