{
  "id": "bf41de14222557c99d0e1e4900c68b14430da091cbdd41f087d5870f5eaf461b",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1763096480,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-1-nov-13-2025-real-work-vs-fake-work-in-a-world-that-runs-on-optics"
    ],
    [
      "title",
      "Free Article 1 (Nov. 13, 2025): Real Work vs. Fake Work in a World That Runs on Optics"
    ],
    [
      "published_at",
      "1763096480"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "A personal look at the difference between “doing things that look like work” and doing work that actually moves the needle — in income, integrity, and long-term freedom."
    ],
    [
      "display_date",
      "2025-11-13"
    ],
    [
      "t",
      "work"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "income"
    ],
    [
      "t",
      "calling"
    ],
    [
      "t",
      "burnout"
    ],
    [
      "t",
      "digital-sovereignty"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "e6008633b6286d02abaaeec4b42bb87535c77e7f1e17fd1a4f65008b0839b7ad",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Nov. 13, 2025\n\nThere’s a special kind of exhaustion that doesn’t come from hard work.\n\nIt comes from fake work.\n\nYou know the difference. Your body might be tired after real work, but your spirit feels strangely awake. You’re sore, maybe a little frazzled, but there’s a quiet sense of, “That mattered.”\n\nFake work is the opposite. Your brain is fried, your shoulders are tight, you’ve clicked on more tabs than you can count, and yet you still feel like you’re behind. Somehow, despite spending the whole day “doing stuff,” nothing really moved.\n\nThe modern world is built to reward fake work.\n\nReal work — the kind that builds something, serves someone, or changes your own trajectory — is strangely harder to justify, especially when you’re under pressure and low on cash. It’s tempting to reach for the nearest thing that *looks* like a respectable path instead of doing the slower, scarier thing that might actually get you free.\n\nLately, I’ve been feeling that tension everywhere.\n\nOn paper, the “responsible” move might be to chase the kind of junior-level job that fits neatly on LinkedIn. Something that checks all the boxes: salary, benefits, a title that doesn’t make anyone uncomfortable at a family dinner. Something that convinces other people that my life is on the “right track.”\n\nBut under the surface, I know what those jobs often look like: endless Jira tickets, Zoom calls about things that don’t matter, buzzword compliance, and spending most of my energy maintaining someone else’s illusions.\n\nFake work doesn’t just waste time. It eats your soul slowly.\n\n---\n\n## The weird shame of “small” real work\n\nHere’s the paradox: when you’re strapped for cash, the work that’s most available is often the kind you’re “too qualified” for — or the kind that doesn’t fit your carefully curated story.\n\nWashing dishes. Dog-sitting. Delivering groceries. Setting up someone’s printer. Helping a neighbor list their stuff on Facebook Marketplace. Translating an email. Editing a document for someone who doesn’t know where to start.\n\nIs that beneath me? No.\n\nIs it “on brand”? Also no.\n\nAnd yet, those little things are often more honest and more *real* than entire careers built on corporate theater. You show up, you serve, you make someone’s life tangibly better, you get paid, and then you go home. There’s a simplicity in that that I find almost holy.\n\nThe shame doesn’t come from the work; it comes from the story I think I’m supposed to be living.\n\nWe’ve all inhaled this idea that our work must be impressive, scalable, or easily explained to strangers. That our path must fit into a narrative arc that other people applaud. If it doesn’t, we worry we’ve somehow failed.\n\nBut what if the real failure is spending decades doing fake work just to avoid looking “small”?\n\n---\n\n## Real work actually changes the future\n\nReal work doesn’t always pay right away, but it changes the playing field.\n\nWriting the hard essay that nobody asked for but that crystallizes your thinking — that’s real work.\n\nBuilding a small tool, script, or system that saves you hours later — real work.\n\nStanding up another brick in a long-term project that may not pay for months but could unlock actual leverage — real work.\n\nThese things don’t give you instant social points. There’s no HR department handing you a salary and a benefits package for them. But over time, they compound.\n\nThe problem is: when the rent is due, compounding is the last thing on your mind.\n\nSo you end up split in half. One part of you is trying to survive *today*; the other part is trying to build something that could make survival less desperate *tomorrow*.\n\nFake work usually shows up offering to “solve” this tension. It gives you the illusion of forward motion and the illusion of safety at the same time. But the cost is that you hand your energy — and often your integrity — to something that doesn’t align with who you are or what you’re called to build.\n\n---\n\n## The hidden cost of optics\n\nA lot of modern career pressure is really optics pressure.\n\nWhen someone says, “You should just get a job,” they rarely mean, “You should find the most honest, soul-aligned way to serve others and earn money.” They usually mean, “You should plug into one of the standard templates so I can stop worrying about you.”\n\nAnd I get it. People care in their own way. They want you to be okay. But their definition of “okay” is often “visibly conventional.”\n\nHere’s the risk: when you chase optics, you start optimizing for *appearance* instead of *trajectory*.\n\nYou might accept a role that keeps you barely afloat financially while consuming every bit of your creative bandwidth. You might stay in an industry that works directly against your convictions because it’s “too late to pivot.” You might spend five or ten years climbing a ladder that leads to a roof you never wanted to stand on.\n\nMeanwhile, the work that could actually move you — and maybe others — toward more sovereignty sits in the back corner of your life like a hobby you feel guilty about.\n\n---\n\n## Reframing “small” work as training\n\nLately I’ve been trying a different lens:\n\n- Small, concrete jobs (even low-status ones) = **cash flow + humility training**\n- Ongoing creative or entrepreneurial work = **long-term leverage**\n- Fake work = **anything that burns energy without either**\n\nBy that definition, washing dishes for a few hours a week to keep the lights on — while still protecting time to write, build, or ship — is more honorable than locking into a “respectable” full-time job that swallows your calling whole.\n\nI’m not romanticizing poverty or struggle. I’d love to reach the point where the things I’ve been building are generating enough income that I don’t have to think about this so much. But that’s part of the journey, not an indictment.\n\nMaybe the real measure isn’t, “Does my work impress people right now?” but, “Is my work building the kind of future where I can live honestly?”\n\nIf a season of “small” work is what allows me to keep building the deep stuff, then maybe that season is a gift, not a failure.\n\n---\n\n## Choosing your exhaustion\n\nAt some point, we all have to decide what kind of tired we’re willing to be.\n\nI’d rather be tired from:\n\n- carrying responsibility for something I believe in  \n- saying no to fake opportunities that don’t align  \n- doing humble, practical work that bridges the gap  \n\n…than from:\n\n- keeping up appearances  \n- sitting through pointless meetings  \n- pretending not to see the compromises under the hood  \n\nNone of this is easy. Some days, I absolutely want the simple, predictable answer. The path where someone else just hands me a script, a paycheck, and a neat narrative to hand to relatives at the next family gathering.\n\nBut deep down, I know that script would be fake work. And I’m too tired to be fake.\n\nI’d rather stumble forward, one imperfect day at a time, doing work that’s real — even if it looks small, confusing, or unimpressive from the outside.\n\nReal work might not look like success yet.\n\nBut it feels like telling the truth with my life. And that’s worth more than optics.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net\n\n## Copyright\n\n© 2025 Continuum — All rights reserved.",
  "sig": "198d9995ab4e63f3ff9f00b73382388e0141e1f55a8826d6722916b7f7ef7fa138e3ef4b62eed88de6f70ba41cf89eaba22cc29aa9cf157c85cf7bfda38a10c5",
  "_source": [
    "wss://nos.lol",
    "primal backup",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://nostr.bitcoiner.social",
    "wss://relay.damus.io"
  ]
}