{
  "content": "Andrew G. Stanton - Aug. 9, 2025\n\nIn the world of finance, words matter. The way an asset is classified under law shapes how it can be owned, traded, taxed, and regulated. Michael Saylor has often made a crucial distinction: **Bitcoin is property** — like real estate, gold, or cash — while most other cryptocurrencies (altcoins, tokens, NFTs, smart contract platforms) are **likely securities**.\n\nUnderstanding this difference isn’t just academic — it affects everyone from individual investors to global institutions. And it’s a point that gets lost in the common “Bitcoin is just another crypto” narrative.\n\n---\n\n## What Is a Security?\n\nA *security* is a financial instrument that represents an investment in a common enterprise, with the expectation of profit derived from the efforts of others. In U.S. law, this definition comes from the **Howey Test**, established by the Supreme Court.\n\nIf something meets this test, it falls under securities regulations — meaning:\n\n- It must be registered with regulatory bodies (like the SEC) unless exempt.\n- It is subject to disclosure requirements, investor protections, and anti-fraud laws.\n- Issuers and promoters can be held legally responsible for misleading claims.\n\nMost **altcoins, ICOs, governance tokens, and NFTs** fit this mold. They are typically created, promoted, and managed by identifiable teams who promise future improvements or benefits — the classic hallmarks of a security.\n\n---\n\n## What Is Property?\n\n*Property* is something you own outright, with no counterparty risk and no expectation of performance from a third party. Examples include:\n\n- Land you’ve purchased  \n- Physical gold  \n- Cash in hand  \n\nImportantly, **commodities are also property**. Oil, wheat, gold, and silver are treated in law as physical property, even when traded in futures markets. They are scarce, fungible, and do not depend on an issuer to maintain their value.\n\n**Bitcoin is digital commodity property.** Like gold, it is mined, scarce, and fungible. It has no central issuer, no board of directors, no promises of future work. The Bitcoin network operates independently of any one person’s efforts. Owning Bitcoin is akin to owning a piece of digital land or gold — verifiable, transferable, and free from third-party obligations.\n\n---\n\n## The Honesty the Crypto Industry Avoids\n\nIf the broader crypto industry were honest, many of its leaders would simply say:\n\n> “Yes, most of our coins and tokens are securities under the Howey Test.”\n\nThat admission would have huge consequences:\n\n- Investors would compare tokens to stocks — and realize many offer **no equity, no dividends, no governance rights**.  \n- Marketing would shift from “decentralized revolution” to “speculative investment in a company-like project.”  \n- Regulators would have a clearer case for enforcement, forcing projects to comply with securities laws.\n\nBut the industry avoids this honesty for a reason. By blurring the line, they can lump Bitcoin in with their tokens, suggesting that if Bitcoin is legitimate, so are they. This **false equivalence** shields them from scrutiny and lets them ride Bitcoin’s credibility without earning it.\n\n---\n\n### Case Study: Evergreen Coin (EGC)\n\nEvergreen Coin (evergreencoin.org) marketed itself as a green, community-driven cryptocurrency, offering:\n- ~7% annual staking rewards (denominated in EGC).  \n- Monthly EGC payouts — often just $1–$2 worth — for “Proof of Environment (tm)” projects.\n\nIn reality:\n- **Massive price collapse** → EGC fell from about $0.05 to $0.0008 USD, a loss of over 98%.  \n- **Illusion of yield** → 7% in a collapsing, illiquid token often translated to real-world losses, not profits.  \n- **Thin liquidity** → Rewards were hard to sell or convert into usable local currency.  \n- **Dependency on outside subsidy** → In one case, a supporter collected EGC on behalf of participants and personally sent them USD via World Remit when holdings exceeded ~$20, sometimes adding a personal bonus if selected to help. Without this outside funding, rewards would have been functionally worthless.\n\nThe idea of “Proof of Environment (tm)” had potential — rewarding verifiable environmental projects with digital money. But in EGC’s execution, it became:\n- A **trademarked and copyrighted brand** controlled by the founder, rather than an open standard.  \n- Tied to a failing token economy instead of a universally valuable currency like Bitcoin.  \n- A blend of non-profit branding (501(c)(3) registration) and speculative asset promotion, creating ethical and legal gray zones.\n\n**Note:** Because “Proof of Environment (tm)” is trademarked by the EGC founder, others cannot use the exact term for a sats-based or open implementation without permission. While nothing stops someone from rewarding environmental projects in sats under a different name, locking the phrase runs counter to the open ethos that allows good ideas to spread freely.\n\n**Lesson:** Good ideas like “proof of environment” should be implemented with open standards and hard money (sats), not illiquid, inflationary tokens controlled by a single entity.\n\n---\n\n## The Ethical Problem With Promoting Unregistered Securities\n\nGroups like CW3 — often unknowingly, sometimes knowingly — promote tokens that meet the legal definition of unregistered securities. This is not just a legal gray area; it’s an ethical one:\n\n- **It misleads participants** into thinking these assets carry the same credibility as Bitcoin.  \n- **It exposes people to hidden legal risks** if projects are later shut down or restricted by regulators.  \n- **It erodes trust** in the broader digital asset movement by lumping legitimate property like Bitcoin in with speculative, unregulated ventures.\n\nPretending the difference doesn’t exist helps promoters — but it harms the people they claim to serve.\n\n---\n\n## Property vs. Security vs. Commodity — At a Glance\n\n| Category      | Definition | Examples | Key Risks | Regulatory Body |\n|---------------|------------|----------|-----------|-----------------|\n| **Property**  | Something you own outright with no dependency on third parties for value. | Real estate, gold, cash | Theft, loss, natural depreciation | Varies by jurisdiction (property law) |\n| **Commodity** | A type of property that is fungible, tradable, and not dependent on an issuer. | Oil, wheat, gold, **Bitcoin** | Market volatility, storage | CFTC (in U.S.), other commodity regulators |\n| **Security**  | An investment in a common enterprise with expectation of profit from others’ efforts. | Stocks, bonds, ICO tokens, most altcoins, NFTs | Issuer failure, fraud, dilution | SEC (in U.S.), equivalent in other countries |\n\n---\n\n## Why the Distinction Matters\n\n1. **Regulatory Risk**  \n   - Securities are heavily regulated and can be restricted, delisted, or banned in certain jurisdictions.  \n   - Property — especially commodities — has far clearer rules for ownership and transfer.\n\n2. **Counterparty Risk**  \n   - Securities depend on the continued performance and honesty of an issuing entity.  \n   - Bitcoin, as commodity property, carries no such dependency.\n\n3. **Global Portability**  \n   - Bitcoin can be self-custodied and moved across borders without needing permission.  \n   - Securities usually require intermediaries and clearinghouses.\n\n4. **Taxation**  \n   - Property transactions have established frameworks for taxation.  \n   - Securities are often taxed differently, sometimes more heavily, especially on short-term trades.\n\n---\n\n## Why This Is Urgent\n\nRegulators worldwide are catching up with the cryptocurrency industry. Many altcoins will face the full weight of securities laws, potentially wiping out their liquidity and utility. Bitcoin’s classification as property — specifically as a **digital commodity** — makes it uniquely suited for long-term holding, global transfer, and institutional adoption.\n\nIf you’re building your portfolio, your business, or even a national monetary policy around digital assets, **understanding this legal and functional difference is non-negotiable**.\n\n---\n\n## Bottom Line\n\nBitcoin is **digital commodity property** — an incorruptible, borderless store of value.  \nMost other crypto assets are **digital securities** — speculative instruments that depend on the success or failure of their issuers.\n\nIf you want an asset you can hold without trusting anyone, that’s immune to dilution, seizure, or fraud, Bitcoin stands alone.\n\n---\n\n**Author’s Note:** This article was researched, drafted, and refined in collaboration with “Dr. C” (ChatGPT) to help organize, clarify, and present these ideas more effectively.",
  "created_at": 1763243503,
  "id": "d4a33c8df2710b51cb0cb343baf270fcef6ca92034b46890513963d60ac08906",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "bfd77186e1e97c6b471b94e0cb82839f3904c0925267cc10db8498d32e21c54ebb6906c14d93b5e5f180c8bba05bf3b3eb919c171e11977692cdce80386fc125",
  "tags": [
    [
      "d",
      "bitcoin-property-not-a-security--why-the-distinction-matters-full-version"
    ],
    [
      "title",
      "Bitcoin: Property, Not a Security — Why the Distinction Matters (full version)"
    ],
    [
      "published_at",
      "1763243503"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "Understanding the differerence between a property and a security is crucial to understanding why bitcoin should not be considered just another \"crypto\" asset."
    ],
    [
      "display_date",
      "2025-08-09"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "proerty"
    ],
    [
      "t",
      "security"
    ],
    [
      "t",
      "commodity"
    ],
    [
      "e",
      "7791f2e5bddec94405cb5605fb7257e62265f2dd17ff99e255e85cfb116d9f5d",
      "edit"
    ]
  ],
  "_source": [
    "wss://nostr.mom",
    "wss://nos.lol",
    "wss://relay.snort.social",
    "wss://relay.damus.io"
  ]
}