{
  "id": "da346ceb07d924e5d3e75b556979d78d999414d60dd0383849986d66388a9d8c",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1757786310,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-2-sept-11-2025-rethinking-tribal-land-mixed-use-ownership-for-a-sovereign-future"
    ],
    [
      "title",
      "Free Article 2 (Sept. 11, 2025): Rethinking Tribal Land: Mixed-Use Ownership for a Sovereign Future"
    ],
    [
      "published_at",
      "1757786310"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "Drawing from California forest models and the Navajo land experience, this article proposes a hybrid framework where tribal nations can own, steward, and lease land without being trapped by state-imposed reservations. A vision for sovereign land use that honors both tradition and innovation."
    ],
    [
      "display_date",
      "2025-09-11"
    ],
    [
      "t",
      "land"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "indigenous"
    ],
    [
      "t",
      "ownership"
    ],
    [
      "t",
      "future models"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "f02ab965f2b1df7eb7d6b797df690909fffb5e7ae20f4309fd2163ba740d9d4a",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Sept. 11, 2025\n\nWhen Americans think of land ownership, they picture private deeds registered at county courthouses or public parks owned by state and federal governments. But indigenous nations live with a different reality: “ownership” is mediated through a federal trust system that strips away true autonomy. Individuals cannot hold secure title, cannot mortgage property, and cannot build generational wealth in the same way their non-native neighbors can.  \n\nThe result has been dependency. While tribes technically control vast amounts of land, their people remain locked out of full sovereignty. This is not simply a historical injustice; it is an ongoing structural problem.  \n\nThere are models worth studying that point to new possibilities:  \n- **California forest contracts:** Millions of acres are designated for logging, conservation, and recreation, managed through layered agreements.  \n- **Alaska Native Corporations:** Created in the 1970s, they hold land and resources on behalf of indigenous shareholders, blending cultural stewardship with corporate mechanisms.  \n- **Māori trusts in New Zealand:** Indigenous groups retain collective ownership while granting families secure titles, ensuring both continuity and usability.  \n- **Hawaiian homestead programs:** Though imperfect, they demonstrate how cultural land preservation can coexist with individual settlement.  \n\nFrom these examples, a principle emerges: sovereignty and stewardship need not mean locking land away. Instead, nations can retain ultimate jurisdictional sovereignty while individuals and families hold their property as **Sovereign Land Titles**—owned outright by the titleholder, but governed by tribal law rather than county or state authority.  \n\nThis avoids the dead hand of federal trusteeship while preventing the tragedy of alienation. Families could build equity. Tribes could generate revenue through taxation, resource management, or stewardship programs. Communities could attract responsible investment without risking cultural erasure.  \n\nThis vision is not utopian—it reflects arrangements already at work globally. The key difference is that it places sovereignty in indigenous hands, not Washington, D.C. It allows nations to design their own balance of communal and individual use.  \n\nThe struggle for land has always been about freedom. For Native peoples, freedom has too often been promised but withheld. By embracing Sovereign Land Titles, tribes could model a new path for all nations—one that honors tradition, ensures stewardship, and unleashes generational wealth.  \n\nOn this Sept 11, when Americans remember a day when freedom felt fragile, it is worth recalling that many indigenous communities have lived in fragile freedom for centuries. A new model of land ownership could change that reality, turning sovereignty into something tangible, enduring, and future-facing.  \n\n---\n\n**Acknowledgement:** On this Sept 11 anniversary, may we also remember the enduring struggle for freedom among Native peoples. Zaps appreciated. ⚡",
  "sig": "00303bd05436a15138423eddb475e7b5dbfa59473d1a8ff786775a4ac023ae9df9f78a8c845afe80272157eb0ce4b83012d51d5ba032ad6933bdbc37b5e4ef6b",
  "_source": [
    "primal backup"
  ]
}