{
  "id": "dd16e1b498abc906bade4676e8f85574ebc394ebfff0abf4a73ef270eea4e53a",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1755405295,
  "kind": 30023,
  "tags": [
    [
      "d",
      "bitcoin-sovereignty-manifesto-for-native-nations"
    ],
    [
      "title",
      "Bitcoin Sovereignty Manifesto for Native Nations"
    ],
    [
      "summary",
      "This manifesto is written in solidarity, not appropriation. As a descendant of Mayflower settlers who grew up in the Pacific, I have long resonated with displaced peoples — Jews, Hawaiians, Native Nations — whose sovereignty was denied but never erased.  The message is simple: sovereignty matters for all of us. What was once taken openly from Native Nations is now being eroded quietly from everyone through fiat money, surveillance, and dependency."
    ],
    [
      "published_at",
      "1755405295"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "native nations"
    ],
    [
      "t",
      "bitcoin"
    ]
  ],
  "content": "## Foreword\n\n**Sovereignty is for all of us.**  \nNot just for nations long denied it, but even for the so-called *“privileged”* Westerner who one day wakes up to find their account frozen, their business deplatformed, or their savings eroded by inflation. Slavery today does not always wear chains; often it wears the mask of convenience.\n\nAnd I want to be clear from the beginning:  \nI am not Native American. I am thoroughly Anglo-Saxon. Some of my ancestors came on the Mayflower. By heritage, I come from the settler side, not the dispossessed.\n\nYet — from as far back as I can remember, I’ve felt a deep resonance with displaced peoples. Growing up in the Pacific, I was surrounded by the stories of Hawaiians and Pacific Islanders, who still carry the wound of an overthrown kingdom. I have long been moved by the Jewish people — scattered, oppressed, yet miraculously preserved. And I have always carried deep respect for Native Nations, whose sovereignty was systematically stripped but never erased.\n\nWhat draws me is not romanticism or identity politics. It’s a simple, burning truth: **sovereignty matters.** Peoples who lose it suffer. Peoples who defend it endure. And in my own life, as I struggle against the chains of fiat money and invasive state control, I feel the echo of their struggle in my own.\n\nThis manifesto is not me pretending to be Native, or speaking on behalf of Native Nations. It is an *offering*: words that I hope can give shape to a vision that many are already sensing — that Bitcoin can serve as a tool of sovereignty, a way to break cycles of dependency, and to secure a future of freedom.\n\nWhether or not these words are useful to Native peoples is not mine to decide. My prayer is simply that they will be received in the spirit I intend: with respect, solidarity, and conviction that sovereignty is God-given and worth defending.\n\n— *Andrew G. Stanton*\n\n---\n\n## We Are Nations\n\nWe were nations before treaties, before reservations, before the United States drew its borders across our land.  \nWe remain nations still.\n\nBut for generations, our sovereignty has been denied:\n\n- Our lands taken.  \n- Our treaties broken.  \n- Our economies made dependent on grants, rations, and federal permission.  \n\nThe time has come to reclaim what has always been ours: **sovereignty.**\n\n---\n\n## 1. Sovereign Money\n\nThe U.S. dollar is not ours. It is created, inflated, and controlled by powers outside our nations. It ties us to cycles of debt and dependency.  \n\n**Bitcoin is different.** It belongs to no government. It cannot be devalued by decree. It is borderless, censorship-resistant, and incorruptible. By holding Bitcoin, we hold wealth outside of empire’s reach.  \n\n---\n\n## 2. Sovereign Energy\n\nOur lands hold energy — gas flares, hydro, solar, wind. Too often, this energy has been exploited by outsiders.  \n\nBitcoin mining allows us to turn wasted or stranded energy into sovereign revenue, controlled by our councils and shared with our people.  \n\n---\n\n## 3. Sovereign Banking\n\nToo many of our people are unbanked or underserved by outside institutions.  \n\nWith Bitcoin and the Lightning Network, we can create our own systems of saving, lending, and paying — **tribal banks that answer only to our people.**  \n\n---\n\n## 4. Sovereign Law\n\nOur sovereignty is recognized in law, though often constrained in practice.  \n\nBy adopting Bitcoin, we exercise our inherent right of self-determination. We do not need permission to use money that is not issued by the U.S. government. This is sovereignty in action.  \n\n---\n\n## 5. Sovereign Memory\n\nOur ancestors kept memory in wampum belts, stories, and song.  \n\nToday, Bitcoin gives us another kind of incorruptible ledger — a record that cannot be rewritten by outsiders. It is a tool of truth as well as wealth.  \n\n---\n\n## 6. Sovereign Future\n\nFor our youth, sovereignty cannot be only a memory. It must be a future.  \n\nBy teaching Bitcoin literacy, by building tribal treasuries in Bitcoin, by mining with our own energy, we give our children a chance to live free from dependency.  \n\n---\n\n## The Declaration\n\nWe are still here.  \nWe are sovereign.  \nAnd we will use the tools of this age to remain sovereign for generations to come.  \n\nBitcoin is not a gift from outsiders.  \nIt is a tool for us to seize, to wield, to shape our own destiny.  \n\nWe walked these lands long before fiat, long before the Federal Reserve, long before Washington.  \nWe will walk them long after.  \n\n**Sovereignty now. Sovereignty forever. In Bitcoin.**",
  "sig": "24d8a2ce8fe3492dfe69b8dee85f10f999eef93aa63314ec970cc743398d113f8a3f8945a69f24e454f4037734bb4bcc5da61bf626a1e41f0b652270b2cc4320",
  "_source": [
    "primal backup"
  ]
}