{
  "content": "Andrew G. Stanton - Dec. 27, 2025\n\nThere is a particular kind of tiredness that goes beyond physical exhaustion. It settles deeper, touching motivation, imagination, and resolve. It is the tiredness that comes from carrying responsibility over time, from holding grief without resolution, from continuing without clear reinforcement.\n\nThis kind of fatigue can feel disorienting.\n\nWhen energy fades, it is easy to assume that something has gone wrong. That you should be stronger by now. That perseverance requires a steadiness you no longer feel capable of sustaining.\n\nBut fatigue does not indicate failure.\n\nIt indicates weight.\n\nSome seasons place demands on the heart that cannot be met through effort alone. In these seasons, the expectation of constant strength becomes unrealistic and, eventually, harmful.\n\nFaithfulness is not measured by how much you can push through. It is measured by whether you remain present without abandoning yourself.\n\nWhen you are tired, you are not disqualified. You are still being carried.\n\nThis truth is difficult to accept in a culture that glorifies endurance while quietly dismissing vulnerability. We are taught to admire resilience only when it looks impressive — when it produces results, when it can be narrated as triumph.\n\nBut much of real endurance looks unremarkable. It consists of small continuities: waking up, showing up, refusing to numb or escape, choosing honesty over pretense.\n\nThese choices matter, even when they feel insufficient.\n\nYou do not need to manufacture energy today. You do not need to force clarity. You do not need to justify your pace.\n\nThere are times when the most faithful act is simply to stop pretending that you are stronger than you are.\n\nBeing carried does not mean being passive. It means allowing support to exist beyond your own effort — whether that support comes through faith, relationship, rhythm, or grace.\n\nThe path does not disappear when your strength wanes. It continues beneath you.\n\nToday, let go of the demand to prove anything.\n\nLet tiredness be acknowledged without judgment.  \nLet grief exist without explanation.  \nLet rest be enough.\n\nYou are not failing because you are weary.\n\nYou are still here.\n\nAnd that matters more than you know.",
  "created_at": 1766870255,
  "id": "ed672b42af877d5b9edd0d1e77b2b11583af328c321306f3f5d42c2a19ffb08f",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "0d4f8e469d811adc1bc9269b0d5d76427b65aea9da060e35fc6ce87c8b60283f127a5a6706ae9bf766a6ff9b1eb6f83bd61ce7687140ce90b70588dc4deb936d",
  "tags": [
    [
      "d",
      "sabbath-article-dec-27-2025-when-you-are-tired-you-are-still-being-carried"
    ],
    [
      "title",
      "Sabbath Article (Dec. 27, 2025): When You Are Tired, You Are Still Being Carried"
    ],
    [
      "published_at",
      "1766870255"
    ],
    [
      "client",
      "Continuum-Pro-localhost"
    ],
    [
      "summary",
      "A reflection on fatigue, grief, and the assurance that faithfulness does not depend on constant strength."
    ],
    [
      "display_date",
      "2025-12-27"
    ],
    [
      "image",
      "https://2025.mycontinuum.xyz/archive/pro/nostr/npub19wvckp8z58lxs4djuz43pwujka6tthaq77yjd3axttsgppnj0ersgdguvd/images/2025-12-27-generated-weekend-set.jpg"
    ],
    [
      "t",
      "grief"
    ],
    [
      "t",
      "endurance"
    ],
    [
      "t",
      "sabbath"
    ],
    [
      "t",
      "trust"
    ],
    [
      "t",
      "hope"
    ],
    [
      "t",
      "encouragement"
    ],
    [
      "e",
      "99a7f323d9bd6d6b800ec55cd9f5f555fd0787239d1bc25a59c5e4f8999d3a4c",
      "edit"
    ]
  ],
  "_source": [
    "wss://nos.lol",
    "wss://nostr.mom",
    "wss://nostr.bitcoiner.social",
    "wss://relay.snort.social",
    "wss://relay.damus.io"
  ]
}