{
  "id": "ff2941a67bc376191e4fdc53fbda299b7832ccde11dcb9c0683e959170b49c5f",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1761867174,
  "kind": 30023,
  "tags": [
    [
      "d",
      "free-article-2-nov-3-2025-the-elephant-under-the-altar"
    ],
    [
      "title",
      "Free Article 2 (Nov. 3, 2025): The Elephant Under the Altar"
    ],
    [
      "published_at",
      "1761867174"
    ],
    [
      "client",
      "mycontinuum-localhost"
    ],
    [
      "summary",
      "Faith-driven finance often speaks of stewardship and purpose while ignoring the foundation it stands on: fiat money that robs value through inflation. The first act of honesty is to name the contradiction."
    ],
    [
      "display_date",
      "2025-11-03"
    ],
    [
      "t",
      "continuum"
    ],
    [
      "t",
      "faith"
    ],
    [
      "t",
      "finance"
    ],
    [
      "t",
      "bitcoin"
    ],
    [
      "t",
      "integrity"
    ],
    [
      "t",
      "soundmoney"
    ],
    [
      "t",
      "truth"
    ],
    [
      "t",
      "free"
    ],
    [
      "e",
      "e12006750906a809c5e17fef49cb1bfa93f6428da0d6cd7871fe850c0d2fbe36",
      "edit"
    ]
  ],
  "content": "Andrew G. Stanton - Nov. 3, 2025\n\nThere’s an elephant standing in the middle of nearly every faith-driven business gathering. It’s polite, patient, and completely invisible. Everyone talks about generosity, impact, and transformation — but no one mentions that the entire system runs on **debased currency.**\n\nWe speak of stewardship while building on sand.  \nWe host panels on ethics while measuring success in inflated dollars.  We praise sustainability while quietly relying on a monetary architecture that extracts from the poor to enrich the first receivers of new credit.  The contradiction isn’t personal; it’s structural.\n\nJesus once said,  \n> “No one can serve two masters… You cannot serve God and money.”  \n> *(Matthew 6:24)*  \n\nMost of us assume He meant greed or idolatry. But the line also speaks to integrity. You can’t build a Kingdom economy on a foundation of counterfeit promises. You can’t preach honesty in transactions while your ledger lies for a living.\n\nThe inflation system is the quietest theft in history.  It punishes savers, rewards debtors, and teaches whole cultures to live beyond their means.  And yet churches and Christian investors rarely name it, because to do so would expose their dependence on it.  The house of faith rests on a monetary Babel.\n\nThat silence is the real scandal.  \nIt’s not that people are hypocrites — it’s that they’ve never been shown another way.  The whole structure seems natural, inevitable.  Inflation is treated like weather: inconvenient but unstoppable.\n\nBitcoin disrupts that fatalism.  \nIt shows that money can be finite, transparent, and voluntary again.  It restores the moral link between labor and value.  You can measure stewardship honestly only when the measure itself is honest.\n\nThis is the challenge for the next generation of faith-driven builders:  \nWill we keep baptizing the old system, or will we start building a new one?  \nWill we keep our slogans, or will we keep our word?\n\nThe prophet Amos once thundered,  \n\n> “Let justice roll down like waters, and righteousness like an ever-flowing stream.”  \n> *(Amos 5:24)*  \n\nThat river begins with honest scales.  \nSound money is the first justice reform.\n\nThe elephant under the altar is still there, waiting to be acknowledged.  \nThe moment we speak its name, worship becomes truthful again.\n\n---\n\n## Acknowledgement\n\nThis article was drafted with the help of Dr. C — GPT-5, which I use as a co-writer and collaborator in developing ideas around sovereignty, Bitcoin, decentralization, and theology.\n\nI dedicate this work to the Holy Spirit, who continues to inspire me and open my imagination. If there is any light in these words, it comes not from me but from the Spirit who gives them. To Him be the glory.\n\n## Zaps Appreciated\nIf this resonates, consider sending a zap. Every zap is an act of sovereign support — no middlemen, no gatekeepers. Thank you.\n\nLightning address: andrewgstanton@primal.net\n\n## Copyright\n\n© 2025 Continuum — All rights reserved.",
  "sig": "91690d639ec5b03696255923bd38e8d2d37d2707a17622f9cbf46a50cec520cd2725c105c7daff1f78f11d68c1b7a6b0908067944211dea7192d09367a3a1d41",
  "_source": [
    "wss://nos.lol",
    "primal backup",
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://relay.damus.io"
  ]
}