{
  "id": "1b595054cd2c2f658cda4667e54003334cc9c9c2cec7589b11c9f56396ce4a53",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1748736923,
  "kind": 1,
  "tags": [
    [
      "t",
      "BitcoinMaxi"
    ],
    [
      "t",
      "SoundMoney"
    ],
    [
      "t",
      "ProofOfWork"
    ],
    [
      "t",
      "BuildOnBitcoin"
    ],
    [
      "t",
      "ExitTheNoise"
    ],
    [
      "t",
      "PrincipledTech"
    ],
    [
      "t",
      "BitcoinNotCrypto"
    ],
    [
      "t",
      "NoMoreRugs"
    ],
    [
      "t",
      "SovereignStack"
    ],
    [
      "t",
      "OpenProtocols"
    ],
    [
      "t",
      "TruthOverTrend"
    ],
    [
      "t",
      "Web3Detox"
    ],
    [
      "t",
      "MaxiWithGrace"
    ],
    [
      "t",
      "LudditeWithLaserEyes"
    ]
  ],
  "content": "Let’s clear something up: I don’t hate Web3 folks. Or altcoiners. Not even close.\n\nSome of you are brilliant. Some idealistic. Some genuinely want to change the world — and I respect that.\n\nBut I do think most of you are…\n– Misguided\n– Naive\n– And in a few cases? Just plain greedy\n\nNot because you’re bad people — but because the system you’ve bought into is broken.\n\nI say this from experience. I was there too.\nI chased the innovation narrative. I joined the Discords. I believed the hype.\nAnd for a while, it felt like the future. Until it didn’t.\n\nI watched as:\n\t•\t“Community” became code for unpaid labor and exit liquidity\n\t•\t“Governance” turned into cliques with insider privileges\n\t•\t“Decentralization” meant adding more buzzwords — not removing trust assumptions\n\nAnd while Bitcoin just kept producing blocks every 10 minutes, Web3 kept producing decks, decks, and more decks.\n\nSo no, I don’t hate you. I just don’t believe you’re building anything that will last.\n\nBitcoin isn’t a cooler version of blockchain. It’s a rejection of the entire premise.\nIt’s not fast or flashy. It doesn’t beg for attention. It just works — slowly, reliably, without anyone’s permission.\n\nThere are no airdrops. No pre-mines. No Discord mods deciding who gets a voice.\n\nAnd no — I haven’t been called a Bitcoin maxi too loudly (yet).\nBut I know how this goes. Push back on the hype machine and suddenly you’re the Luddite, the hater, the narrow-minded killjoy.\n\nFunny thing though: I wrote this with the help of Dr. C (ChatGPT) —\nso much for being anti-tech.\n\nThe truth is, I’m not against innovation. I’m against illusions.\nI’m not bitter. I’m just done playing along.\n\nYou’re free to disagree. You’re even free to keep building.\nBut when the rug gets pulled — or the treasury runs dry — or the “community” moves on…\nBitcoin will still be here. Quiet. Steady. Unmoved.\n\nAnd if you come around, you’re welcome here too.\n\nWe’re not enemies. We just bet on different foundations.\n\n#BitcoinMaxi #SoundMoney #ProofOfWork #BuildOnBitcoin #ExitTheNoise #PrincipledTech #BitcoinNotCrypto #NoMoreRugs #SovereignStack #OpenProtocols #TruthOverTrend #Web3Detox #MaxiWithGrace #LudditeWithLaserEyes",
  "sig": "66865703fb3e4118443948df86bc18d313ce89dbc492e1dcaa684a29cef410d04ecc7b60ea8a46159f4cee27d52ee86c151ef6b41840d8201ff241c5641e87be",
  "_source": [
    "primal backup"
  ]
}