{
  "id": "6b73d25b25a4b261301cf7c9104775fe803f097b9966693d101dbe980394dc35",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1761506699,
  "kind": 1,
  "tags": [
    [
      "p",
      "356875ffd729b06eeb4c1d7a70a1f750045d067774d21c0faffe4af2bf96a2e8",
      "wss://nostr.bitcoiner.social",
      "mention"
    ],
    [
      "t",
      "VictoriousGospel"
    ],
    [
      "t",
      "ToChristAlone"
    ]
  ],
  "content": "\n\n\nThe Full Gospel: From Curse to Victory\n\nnostr:nprofile1qqsr26r4lltjnvrwadxp67ns58m4qpzaqemhf5sup7hlujhjh7t296qpr3mhxue69uhkummnw3ezucnfw33k76twv4ezuum0vd5kzmqppamhxue69uhkumewwd68ytnrwg5pml9e \nYou’re right that we are born into sin — cursed since Adam and surrounded by its effects. But the story doesn’t end in despair. The Gospel is not just about what we’ve fallen from, but what Christ has restored us to.\n\n“As in Adam all die, so also in Christ shall all be made alive.” — 1 Cor 15:22\n\nChrist didn’t come merely to cover sin, but to destroy it.\n\n“For this purpose the Son of God was manifested, that He might destroy the works of the devil.” — 1 John 3:8\n\nThat’s the victory — not only pardon but transformation.\n\n“If anyone is in Christ, he is a new creation; the old has passed away, behold, the new has come.” — 2 Cor 5:17\n\nThe cross wasn’t just a rescue mission; it was a cosmic triumph.\n\n“He disarmed the rulers and authorities and put them to open shame, triumphing over them in it.” — Col 2:15\n\nWe deserved hellfire, yes — but we were made for glory. Grace doesn’t merely spare us; it raises us.\n\n“Behold, I am making all things new.” — Rev 21:5\n\nSo when we speak of judgment, let’s also speak of resurrection.\nWhen we speak of sin, let’s also proclaim victory.\nWhen we speak of hell, let’s not forget the empty tomb.\n\nThat’s the full Gospel: not just forgiveness, but the total restoration of humanity and creation under Christ’s reign.\n\n\n#VictoriousGospel #ToChristAlone\n\n\n\n",
  "sig": "b92b2977aba4df97298b48f14557bf7393d10a484552471fe3495c10282c25e54edcb774834abac90b59a4c55d7c4744fb23ebbea9dfaf8491d7b67d042bd304",
  "_source": [
    "primal backup"
  ]
}