{
  "id": "8531330152c6ce49536424f5c2e25dbb306669ee2e11ad106e18053ab31b9f47",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1750005309,
  "kind": 1,
  "tags": [
    [
      "t",
      "Bitcoin"
    ],
    [
      "t",
      "AlohaAina"
    ],
    [
      "t",
      "Sovereignty"
    ],
    [
      "t",
      "ProofOfWork"
    ],
    [
      "t",
      "Decentralization"
    ],
    [
      "t",
      "AkamaiSovereignty"
    ]
  ],
  "content": "🪨 Day 1: A Nation Remembered — And a Deeper Sovereignty\n\n🇬🇧 In 1843, the Kingdom of Hawai‘i was recognized as a sovereign nation by Britain and France.\n\nThat sovereignty was never lawfully ceded.\nIn 1893, it was overthrown — not by a vote, not by a movement, but by outside force.\n\nI wasn’t born in Hawai‘i. I’m not ethnically Hawaiian. I was born in Palau.\nBut two of my siblings were born in Hawai‘i, and the stories of that land shaped my sense of justice — and my respect for true sovereignty.\n\nI’m also a patriotic American. And I believe patriotism includes the courage to face hard truths about our past.\n\nWhat makes the overthrow even more painful is this: Hawai‘i supported the Union during the American Civil War.\nNative Hawaiians volunteered. Confederate ships were barred from Hawaiian ports.\n\nThe Kingdom aligned itself morally with American freedom — and was betrayed by the very nation it once stood with.\n\nAnd yet, Hawai‘i is now a state — and that reality matters too.\nMany are proud to be both Hawaiian and American. Statehood brought new rights, protections, and recognition — but also new tensions.\n\nI don’t believe sovereignty has to mean secession.\nIt can mean living with dignity, owning your future, and reclaiming truth without permission.\n\nThat’s why I choose Bitcoin.\nIt honors time, land, and truth — not politics.\n\nHawai‘i was a nation. It is now a state. But its story — and its people — still teach us what it means to be free.\n\n\n\n#Bitcoin #AlohaAina #Sovereignty #ProofOfWork #Decentralization #AkamaiSovereignty\n\nhttps://blossom.primal.net/a8d0d64df834147b4dd7e0d24d064ab12de51ef63ff74481bca0adc019365cdc.png",
  "sig": "94416ac3506c6357606293ee5ca5e9b7a69c3bee112aba2327e831bde107b4d78506b9c5c54627afd136687a77f80f8c11f7329e7638177ff5999aa2513be50c",
  "_source": [
    "primal backup"
  ]
}