{
  "id": "e681d327f184a48ec06e489a375e7634755b49f30b989b809debb0fe587b3688",
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "created_at": 1748209403,
  "kind": 1,
  "tags": [
    [
      "t",
      "Nostr"
    ],
    [
      "t",
      "SelfSovereignty"
    ],
    [
      "t",
      "FreedomWithLimits"
    ],
    [
      "t",
      "PornRecovery"
    ],
    [
      "t",
      "Faith"
    ],
    [
      "t",
      "DigitalDignity"
    ],
    [
      "t",
      "ContentBoundaries"
    ],
    [
      "t",
      "IntentionalPosting"
    ],
    [
      "t",
      "MyContinuum"
    ],
    [
      "t",
      "Grace"
    ],
    [
      "t",
      "Integrity"
    ],
    [
      "t",
      "Galatians5"
    ],
    [
      "t",
      "Proverbs25"
    ],
    [
      "t",
      "OnlineCulture"
    ]
  ],
  "content": "Freedom Isn’t the Same as Exposure\n\nI saw an explicit sexual post on Nostr today—graphic, pornographic content, pushed into a public feed. I asked why. No answer. So I muted and unfollowed.\n\nNot out of judgment. Out of conviction.\n\nSome might say it’s “just free expression”—two people enjoying each other. But real freedom includes the right to say no, to walk away, to guard your mind and heart.\n\nFor me, this is personal.\nI was addicted to porn for years.\n\nIt numbed me. Twisted how I saw people. Eroded real intimacy. And for a long time, I didn’t know who I was without it. But by God’s grace, I’m free now. Not because of willpower. Because of mercy, community, and truth.\n\n“Like a city whose walls are broken through is a person who lacks self-control.” — Proverbs 25:28\n“It is for freedom that Christ has set us free.” — Galatians 5:1\n\nSo when I see that content show up in a shared, open space, I draw a line.\nNot because I’m fragile. But because I’m clear.\n\nSelf-sovereignty doesn’t mean forcing others to accept what you post.\nIt means taking full responsibility for what we create, curate, and walk away from.\n\nI’m building mycontinuum because I want to give people a place to remember without manipulation…\nTo preserve truth, not feeds…\nTo live with dignity, not distraction.\n\nI don’t want to go back. And I don’t want others to stay stuck.\n\n⸻\n\nYou’re not alone. And you’re not beyond freedom.\n\n⸻\n\nHashtags:\n\n#Nostr #SelfSovereignty #FreedomWithLimits #PornRecovery #Faith #DigitalDignity #ContentBoundaries #IntentionalPosting #MyContinuum #Grace #Integrity #Galatians5 #Proverbs25 #OnlineCulture",
  "sig": "2dd990139f47ba6d8a1d25ba6631b1743775d6fac92cf57e85ff3489daa7c8890a079510ce4e1347e5fce0ab72a10a29e0f347e295af39cdad0359ef2ede24f5",
  "_source": [
    "primal backup"
  ]
}